*-------------------------------------------------------------------*
*creation date :21/06/2010                                          *
*created by m.turkmen                                               *
*PTT merkezlerinin POSTANET2004 projesi kapsaminda yaptiklari       *
*islemlerin muhasebe hesaplarina otomatik olarak yansitilmasini     *
*saglayan programdir.                                               *
*                                                                   *
*                                                                   *
*                                                                   *
*                                                                   *
*-------------------------------------------------------------------*
?env common
?SQL
?HEADING "ENT01SC"
?SYMBOLS, INSPECT
?highpin
?SAVEABEND
?SEARCH $DATA18.MUHOBJ.STAKVIMO
?SEARCH $DATA18.MUHOBJ.SFSIRAO
?SEARCH $DATA18.MUHOBJ.SEFSIRAO
?SEARCH $DATA18.MUHOBJ.SFISBASO
?SEARCH $DATA18.MUHOBJ.SFISDETO
?SEARCH $DATA18.MUHOBJ.SHESPLAO
?SEARCH $DATA18.MUHOBJ.SBAKKNTO
?SEARCH $DATA18.MUHOBJ.SENTHESO
?SEARCH $DATA18.MUHOBJ.SHOZTHSO
?SEARCH $DATA18.MUHOBJ.SOZTYHSO
?SEARCH $DATA18.MUHOBJ.SHESNOO
?SEARCH $DATA18.MUHOBJ.SDGTMO
*
 IDENTIFICATION DIVISION.
 PROGRAM-ID. ENT01SO IS INITIAL PROGRAM.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SPECIAL-NAMES.
     FILE "$SYSTEM.SYSTEM.COBOLLIB" IS COBOLLIB,
     FILE "$SYSTEM.SYSTEM.CBL85UTL" IS CBL85UTL.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
 DATA DIVISION.
 FILE SECTION.
*

*******************************************************************************
*
 WORKING-STORAGE SECTION.
*
 01 WS-PARAMETER-HATA.
    03 WS-SOURCE-CODE-NAME   PIC X(08).
    03 WS-HATA-TABLE-NAME    PIC X(15).
    03 WS-HATA-CURSOR-NAME   PIC X(15).
    03 WS-HATA-MESAJI-TIPI   PIC X(20).
    03 WS-HATA-MESAJI        PIC X(100).
    03 WS-HATA-SUBPROG-NAME  PIC X(08).
 01 WS-PARAMETER-FLAG.
    03 WS-ERROR-FLAG            PIC X(01).
       88 WS-FATAL-ERROR        VALUE "1".
    03 WS-KART-FLAG             PIC 9(01).
       88 WS-KARTSIZ-IZIN-FLAG  VALUE 1.
    03 WS-FLAG2                 PIC X(01).
       88 WS-KASA-HESAP-FLAG    VALUE "1".
    03 WS-FLAG3                 PIC X(01).
       88 WS-DEKONT-HESAP-FLAG  VALUE "1".
    03 WS-FLAG4                 PIC X(01).
       88 WS-KDV-VAR-FLAG       VALUE "1".
    03 WS-FLAG5                 PIC X(01).
       88 WS-KDV-DAHIL-FLAG     VALUE "1".
    03 WS-FLAG6                 PIC X(01).
       88 WS-KDV-HARIC-FLAG     VALUE "1".
    03 WS-FLAG7                 PIC X(01).
       88 WS-KOMISYON-VAR-FLAG  VALUE "1".
    03 WS-FLAG8                 PIC X(01).
       88 WS-DOVIZ-FLAG         VALUE "1".
    03 WS-FLAG9                 PIC X(01).
       88 WS-BASARISIZ-FLAG     VALUE "1".
    03 WS-FLAG10                PIC X(01).
       88 WS-CURSOR-ACIK-FLAG   VALUE "1".
    03 WS-FLAG11                     PIC X(01).
       88 WS-TRANSACTION-BITIR-FLAG  VALUE "1".
    03 WS-FLAG12                     PIC X(01).
       88 WS-KONSINYE-FLAG           VALUE "1".
    03 WS-FLAG13                    PIC X(01).
       88 WS-BSMV-FLAG               VALUE "1".
 01 RECEIVE-FILE-STATUS.
    02 RECEIVE-FILE-STAT-1           PIC 9(01) VALUE 0.
    02 RECEIVE-FILE-STAT-2           PIC 9(01) VALUE 0.
 01 REC-FILE-STAT REDEFINES RECEIVE-FILE-STATUS PIC 9(02).
    88 RECEIVE-FILE-OK               VALUE 0.
    88 RECEIVE-FILE-EOF              VALUE 10.
 01 WS-VARIAB-INIT.
*   03 I-SAY                         PIC 9(04).
    03 K-SAY                         PIC 9(04).
    03 L-SAY                         PIC 9(04).
    03 J-SAY                         PIC 9(03).
    03 OK-MSG                        PIC 9(01).
    03 OK-MSG-ENT                    PIC 9(01).
    03 OK-MESSAGE                    PIC 9(01).
    03 WS-MERKEZ-ADET                PIC 9(07).
    03 WS-TEMP-TUTAR                 PIC S9(16)V99.
    03 WS-TOPLAM-KDVLI-TUTAR         PIC S9(16)V99.
    03 WS-KDV-TUTAR                  PIC S9(16)V99.
    03 WS-TOPLAM-BORC-TUTAR          PIC S9(16)V99.
    03 WS-TOPLAM-ALACAK-TUTAR        PIC S9(16)V99.
    03 WS-DETAY-SIRA-NO              PIC 9(03).
    03 WS-KESILEN-KDV                PIC S9(16)V99.
    03 WS-KDV-HESAP-ADET             PIC 9(01).
    03 WS-CURRENT-DATE               PIC 9(08).
    03 WS-VALOR-TARIHI               PIC 9(08).
    03 WS-DEKONT-HESAP               PIC X(03).
    03 WS-KDV-HESAP-REF-NO           PIC X(12).
    03 WS-ADET                       PIC 9(04).
    03 WS-ADET-MERKEZ                PIC 9(04).
    03 WS-ADET-1                     PIC 9(04).
    03 WS-ADET-2                     PIC 9(04).
    03 WS-ADET-3                     PIC 9(04).
    03 WS-ADET-4                     PIC 9(04).
    03 WS-HESAP-REF-NO               PIC X(12).
    03 WS-FIS-TURU                   PIC X(03).
    03 WS-FIS-ACIKLAMA               PIC X(255).
    03 WS-BORC-TUTAR                 PIC S9(16)V99.
    03 WS-ALACAK-TUTAR               PIC S9(16)V99.
    03 WS-DGT-KODU                   PIC X(03).
    03 DON-MSG                       PIC 9(01).
    03 DON-MSG-1                     PIC 9(01).
    03 WS-RESPONSE-CODE              PIC X(04).
    03 WS-RESPONSE-COUNTER           PIC X(02).
    03 WS-DOVIZ-MIKTAR               PIC S9(16)V99.
    03 WS-DOVIZ-KURU                 PIC S9(13)V9(05).
 01 WS-KURULUS-KODU                  PIC 9(01) VALUES 1.
 01 WS-GISE-FIS-ACIKLAMA             PIC X(255) VALUES
 "POSTANET SUBE/GISE ENTEGRASYONU (OTOMATIK)".
 01 WS-ATM-FIS-ACIKLAMA              PIC X(255) VALUES
 "POSTANET ATM/GISE ENTEGRASYONU (OTOMATIK)".
 01 WS-SUBPROG-VARIAB.
    03 WS-STAKVIM-YIL                PIC 9(04).
    03 WS-STAKVIM-AY                 PIC 9(02).
    03 WS-STAKVIM-GUN                PIC 9(02).
    03 WS-STAKVIM-SONUC              PIC X(10).
    03 WS-STAKVIM-KONTROL-FLAG       PIC X(05).
    03 WS-STAKVIM-HATA-MESAJI        PIC X(100).
    03 WS-STAKVIM-SQL-ERR            PIC S9(04).
    03 WS-STAKVIM-SYS-ERR            PIC S9(04).
    03 WS-SHESPLA-KURULUS-KODU       PIC 9(01).
    03 WS-SHESPLA-HES-REF-NO         PIC X(12).
    03 WS-SHESPLA-KONTROL-FLAG       PIC X(03).
    03 WS-SHESPLA-SYS-ERR            PIC S9(04).
    03 WS-SHESPLA-SQL-ERR            PIC S9(04).
    03 WS-SHESNO-KURULUS-KODU        PIC 9(01).
    03 WS-SHESNO-HES-REF-NO          PIC X(12).
    03 WS-SHESNO-HESAP-NO            PIC X(39).
    03 WS-SHESNO-SYS-ERR             PIC S9(04).
    03 WS-SHESNO-SQL-ERR             PIC S9(04).
    03 WS-SFSIRA-KURULUS-KODU        PIC 9(01).
    03 WS-SFSIRA-BOLGE-KODU          PIC 9(03).
    03 WS-SFSIRA-MERKEZ-NO           PIC 9(05).
    03 WS-SFSIRA-SUBE-NO             PIC 9(03).
    03 WS-SFSIRA-GISE-NO             PIC 9(04).
    03 WS-SFSIRA-FIS-TURU            PIC X(03).
    03 WS-SFSIRA-SIRA-NO             PIC 9(07).
    03 WS-SFSIRA-SYS-ERR             PIC S9(04).
    03 WS-SFSIRA-SQL-ERR             PIC S9(04).
    03 WS-SEFSIRA-KURULUS-KODU       PIC 9(01).
    03 WS-SEFSIRA-BOLGE-KODU         PIC 9(03).
    03 WS-SEFSIRA-MERKEZ-NO          PIC 9(05).
    03 WS-SEFSIRA-SUBE-NO            PIC 9(03).
    03 WS-SEFSIRA-GISE-NO            PIC 9(04).
    03 WS-SEFSIRA-FIS-TURU           PIC X(03).
    03 WS-SEFSIRA-YIL                PIC 9(04).
    03 WS-SEFSIRA-AY                 PIC 9(02).
    03 WS-SEFSIRA-GUN                PIC 9(02).
    03 WS-SEFSIRA-SIRA-NO            PIC 9(07).
    03 WS-SEFSIRA-SYS-ERR            PIC S9(04).
    03 WS-SEFSIRA-SQL-ERR            PIC S9(04).
    03 WS-SFISBAS-KURULUS-KODU       PIC 9(01).
    03 WS-SFISBAS-BOLGE-KODU         PIC 9(03).
    03 WS-SFISBAS-MERKEZ-NO          PIC 9(05).
    03 WS-SFISBAS-SUBE-NO            PIC 9(03).
    03 WS-SFISBAS-GISE-NO            PIC 9(04).
    03 WS-SFISBAS-ISLEM-YIL          PIC 9(04).
    03 WS-SFISBAS-ISLEM-AY           PIC 9(02).
    03 WS-SFISBAS-ISLEM-GUN          PIC 9(02).
    03 WS-SFISBAS-FIS-TURU           PIC X(03).
    03 WS-SFISBAS-FIS-NO             PIC 9(07).
    03 WS-SFISBAS-ISLEM-ID           PIC S9(12).
    03 WS-SFISBAS-FIS-ACIKLAMA       PIC X(255).
    03 WS-SFISBAS-KARSI-BOLGE-KODU   PIC 9(03).
    03 WS-SFISBAS-KARSI-MERKEZ-NO    PIC 9(05).
    03 WS-SFISBAS-KARSI-BELGE-YIL    PIC 9(04).
    03 WS-SFISBAS-KARSI-BELGE-AY     PIC 9(02).
    03 WS-SFISBAS-KARSI-BELGE-GUN    PIC 9(02).
    03 WS-SFISBAS-KARSI-BELGE-TURU   PIC X(03).
    03 WS-SFISBAS-KARSI-BELGE-NO     PIC 9(07).
    03 WS-SFISBAS-KASA-ONAY          PIC X(02).
    03 WS-SFISBAS-FIS-STATUS         PIC 9(01).
    03 WS-SFISBAS-VALOR-YIL          PIC 9(04).
    03 WS-SFISBAS-VALOR-AY           PIC 9(02).
    03 WS-SFISBAS-VALOR-GUN          PIC 9(02).
    03 WS-SFISBAS-MADDE-NO           PIC 9(07).
    03 WS-SFISBAS-DEFTER             PIC 9(01).
    03 WS-SFISBAS-EKL-SICIL-NO       PIC S9(11).
    03 WS-SFISBAS-KONTROL-FLAG       PIC X(05).
    03 WS-SFISBAS-HATA-MESAJI        PIC X(100).
    03 WS-SFISBAS-SYS-ERR            PIC S9(04).
    03 WS-SFISBAS-SQL-ERR            PIC S9(04).
    03 WS-SFISDET-KURULUS-KODU       PIC 9(01).
    03 WS-SFISDET-BOLGE-KODU         PIC 9(03).
    03 WS-SFISDET-MERKEZ-NO          PIC 9(05).
    03 WS-SFISDET-SUBE-NO            PIC 9(03).
    03 WS-SFISDET-GISE-NO            PIC 9(04).
    03 WS-SFISDET-ISLEM-YIL          PIC 9(04).
    03 WS-SFISDET-ISLEM-AY           PIC 9(02).
    03 WS-SFISDET-ISLEM-GUN          PIC 9(02).
    03 WS-SFISDET-FIS-TURU           PIC X(03).
    03 WS-SFISDET-FIS-NO             PIC 9(07).
    03 WS-SFISDET-HESAP-REF-NO       PIC X(12).
    03 WS-SFISDET-FIS-ACIKLAMA       PIC X(255).
    03 WS-SFISDET-SIRA-NO            PIC 9(07).
    03 WS-SFISDET-DGT-TIPI           PIC X(02).
    03 WS-SFISDET-DGT-KODU           PIC X(03).
    03 WS-SFISDET-YRD-KART-NO        PIC X(20).
    03 WS-SFISDET-YRD-KART-TIPI      PIC X(02).
    03 WS-SFISDET-BORC-TUTAR         PIC S9(16)V99.
    03 WS-SFISDET-ALACAK-TUTAR       PIC S9(16)V99.
    03 WS-SFISDET-KARSI-DGT-TIPI     PIC X(02).
    03 WS-SFISDET-KARSI-DGT-KODU     PIC X(03).
    03 WS-SFISDET-KUR                PIC S9(13)V9(5).
    03 WS-SFISDET-DOVIZ-MIKTAR       PIC S9(16)V99.
    03 WS-SFISDET-ODEME-KODU         PIC X(05).
    03 WS-SFISDET-FIS-STATUS         PIC 9(01).
    03 WS-SFISDET-EKL-SICIL-NO       PIC S9(11).
    03 WS-SFISDET-KONTROL-FLAG       PIC X(05).
    03 WS-SFISDET-HATA-MESAJI        PIC X(100).
    03 WS-SFISDET-SYS-ERR            PIC S9(04).
    03 WS-SFISDET-SQL-ERR            PIC S9(04).
    03 WS-SOZTHES-KURULUS-KODU       PIC 9(01).
    03 WS-SOZTHES-BOLGE-KODU         PIC 9(03).
    03 WS-SOZTHES-MERKEZ-NO          PIC 9(05).
    03 WS-SOZTHES-SUBE-NO            PIC 9(03).
    03 WS-SOZTHES-GISE-NO            PIC 9(04).
    03 WS-SOZTHES-ISLEM-YIL          PIC 9(04).
    03 WS-SOZTHES-ISLEM-AY           PIC 9(02).
    03 WS-SOZTHES-ISLEM-GUN          PIC 9(02).
    03 WS-SOZTHES-HESAP-REF-NO       PIC X(12).
    03 WS-SOZTHES-FIS-TURU           PIC X(03).
    03 WS-SOZTHES-BORC-TUTAR         PIC S9(16)V99.
    03 WS-SOZTHES-ALACAK-TUTAR       PIC S9(16)V99.
    03 WS-SOZTHES-SICIL-NO           PIC S9(11).
    03 WS-SOZTHES-KONTROL-FLAG       PIC X(05).
    03 WS-SOZTHES-SYS-ERR            PIC S9(04).
    03 WS-SOZTHES-SQL-ERR            PIC S9(04).
    03 WS-SHOZTHS-KURULUS-KODU       PIC 9(01).
    03 WS-SHOZTHS-BOLGE-KODU         PIC 9(03).
    03 WS-SHOZTHS-MERKEZ-NO          PIC 9(05).
    03 WS-SHOZTHS-SUBE-NO            PIC 9(03).
    03 WS-SHOZTHS-GISE-NO            PIC 9(04).
    03 WS-SHOZTHS-ISLEM-YIL          PIC 9(04).
    03 WS-SHOZTHS-ISLEM-AY           PIC 9(02).
    03 WS-SHOZTHS-ISLEM-GUN          PIC 9(02).
    03 WS-SHOZTHS-HESAP-REF-NO       PIC X(12).
    03 WS-SHOZTHS-FIS-TURU           PIC X(03).
    03 WS-SHOZTHS-HIZMET-TURU        PIC 9(02).
    03 WS-SHOZTHS-BORC-TUTAR         PIC S9(16)V99.
    03 WS-SHOZTHS-ALACAK-TUTAR       PIC S9(16)V99.
    03 WS-SHOZTHS-SICIL-NO           PIC S9(11).
    03 WS-SHOZTHS-KONTROL-FLAG       PIC X(05).
    03 WS-SHOZTHS-SYS-ERR            PIC S9(04).
    03 WS-SHOZTHS-SQL-ERR            PIC S9(04).
    03 WS-SDGTM-KURULUS-KODU         PIC 9(01).
    03 WS-SDGTM-BOLGE-KODU           PIC 9(03).
    03 WS-SDGTM-MERKEZ-NO            PIC 9(05).
    03 WS-SDGTM-SUBE-NO              PIC 9(03).
    03 WS-SDGTM-GISE-NO              PIC 9(04).
    03 WS-SDGTM-ISLEM-YIL            PIC 9(04).
    03 WS-SDGTM-ISLEM-AY             PIC 9(02).
    03 WS-SDGTM-ISLEM-GUN            PIC 9(02).
    03 WS-SDGTM-HESAP-REF-NO         PIC X(12).
    03 WS-SDGTM-FIS-TURU             PIC X(03).
    03 WS-SDGTM-DGT-TIPI             PIC X(02).
    03 WS-SDGTM-DGT-KODU             PIC X(03).
    03 WS-SDGTM-TUTAR                PIC S9(16)V99.
    03 WS-SDGTM-SICIL-NO             PIC S9(11).
    03 WS-SDGTM-KONTROL-FLAG         PIC X(05).
    03 WS-SDGTM-SYS-ERR              PIC S9(04).
    03 WS-SDGTM-SQL-ERR              PIC S9(04).
    03 WS-ONCEKI-FIS-SIRA-NO         PIC 9(07).
    03 WS-ONCEKI-FIS-TURU            PIC X(03).
    03 WS-GUNUN-TARIHI               PIC 9(08).
    03 WS-ISLEM-TARIHI.
       05 WS-ISLEM-YIL               PIC 9(04).
       05 WS-ISLEM-AY                PIC 9(02).
       05 WS-ISLEM-GUN               PIC 9(02).
    03 WS-ISLEM-TARIHI-INTEGER       PIC 9(08).
    03 WS-KAYITVAR-FLAG              PIC 9(01).

 EXTENDED-STORAGE SECTION.

 01 WS-ENTEG-MERKEZ-VALUES.
    03 WS-ENTEG-MERKEZ-ADET            PIC 9(04).
    03 WS-ENTEG-MERKEZ-DETAY OCCURS 1 TO 5555 TIMES DEPENDING ON
                                       WS-ENTEG-MERKEZ-ADET.
       05 WS-ENTEG-BOLGE-KODU          PIC 9(03).
       05 WS-ENTEG-MERKEZ-NO           PIC 9(05).



 EXEC SQL INCLUDE STRUCTURES ALL VERSION 315   END-EXEC.
 EXEC SQL INCLUDE SQLCA                        END-EXEC.
 EXEC SQL BEGIN DECLARE SECTION END-EXEC.
 EXEC SQL INVOKE =HESPLANI     NULL STRUCTURE AS D-HESPLAN END-EXEC.
 EXEC SQL INVOKE =FISBASLIK    NULL STRUCTURE AS D-FBASLIK END-EXEC.
 EXEC SQL INVOKE =FISDETAY     NULL STRUCTURE AS D-FDETAY  END-EXEC.
 EXEC SQL INVOKE =PARAMETR     NULL STRUCTURE AS D-PARAM   END-EXEC.
 EXEC SQL INVOKE =DONKAPA       NULL STRUCTURE AS D-DONKAPA END-EXEC.
 EXEC SQL INVOKE =OZETHES       NULL STRUCTURE AS D-OZETHES END-EXEC.
 EXEC SQL INVOKE =ISLEMID       NULL STRUCTURE AS D-ISLEMID END-EXEC.
 EXEC SQL INVOKE $DATA18.MUHTAB.HESPLYAN   NULL STRUCTURE AS D-HESPLYAN END-EXEC.
 EXEC SQL INVOKE $DATA18.MUHTAB.ODEMEKOD     NULL STRUCTURE AS D-ODEKOD   END-EXEC.
 EXEC SQL INVOKE $DATA18.MUHTAB.ERRORLOG NULL STRUCTURE AS D-ERRLOG   END-EXEC.
 EXEC SQL INVOKE =OZETLSTY               NULL STRUCTURE AS D-OZET     END-EXEC.
 EXEC SQL INVOKE $DATA18.MUHTAB.ENTEGRS  NULL STRUCTURE AS D-ENTEG    END-EXEC.
 EXEC SQL INVOKE $data18.muhtab.islemtur NULL STRUCTURE AS D-ISLEMTUR END-EXEC.
 EXEC SQL INVOKE =PTTMRK         NULL STRUCTURE AS D-PTTMRK   END-EXEC.
 EXEC SQL INVOKE $DATA18.MUHTAB.ENTSONUC NULL STRUCTURE AS D-ENTSONUC END-EXEC.
 EXEC SQL INVOKE =KURUMMRK               NULL STRUCTURE AS D-KURUMMRK END-EXEC.
 EXEC SQL INVOKE $DATA18.MUHTAB.DAGIKODU NULL STRUCTURE AS D-DAGIKODU END-EXEC.
 01 S-VARIAB-INIT.
    03 S-HESAP-REF-NO      PIC X(12).
    03 s-kasa-hesap        pic x(12).
    03 S-HESAP-REF-COUNTER PIC 9(04).
    03 S-KONSINYE-KURUM-ADET PIC 9(03).
    03 S-TOPLAM-TUTAR      PIC S9(16)V99.
    03 S-BORC-TUTAR        PIC S9(16)V99.
    03 S-ALACAK-TUTAR      PIC S9(16)V99.
    03 S-BAS-ISLEM-YIL     PIC 9(04).
    03 S-BAS-ISLEM-AY      PIC 9(02).
    03 S-BAS-ISLEM-GUN     PIC 9(02).
    03 S-BIT-ISLEM-YIL     PIC 9(04).
    03 S-BIT-ISLEM-AY      PIC 9(02).
    03 S-BIT-ISLEM-GUN     PIC 9(02).
    03 S-ISLEM-TARIHI.
       05 S-ISLEM-YY       PIC 9(04).
       05 S-ISLEM-MM       PIC 9(02).
       05 S-ISLEM-DD       PIC 9(02).
    03 S-BOLGE-KODU        PIC 9(03).
    03 S-MERKEZ-NO         PIC 9(05).
    03 S-ATM-TAHSIL-HESAP  PIC X(12).
    03 S-ATM-TEDIYE-HESAP  PIC X(12).
    03 S-ATM-AKTAR-HESAP   PIC X(12).
    03 S-BSMV-HESAP-740    PIC X(12).
    03 S-BSMV-HESAP-360    PIC X(12).
    03 S-ONCEKI-MERKEZ-NO  PIC 9(05).
    03 S-ONCEKI-SUBE-NO    PIC 9(03).
    03 S-ONCEKI-GISE-NO    PIC 9(04).
    03 S-SIRA-NO           PIC 9(07).
    03 S-ENT-TUTAR         PIC S9(16)V99.
    03 S-ENT-TUTAR1        PIC S9(16)V99.
    03 S-ENT-TUTAR2        PIC S9(16)V99.
    03 S-ENT-TUTAR3        PIC S9(16)V99.
    03 S-ENT-TUTAR4        PIC S9(16)V99.
    03 S-ENT-TUTAR5        PIC S9(16)V99.
    03 S-ENT-TUTAR6        PIC S9(16)V99.
    03 S-ENT-TUTAR7        PIC S9(16)V99.
    03 S-ENT-TUTAR8        PIC S9(16)V99.
    03 S-ENT-TUTAR9        PIC S9(16)V99.
    03 S-ENT-TUTAR10       PIC S9(16)V99.
    03 S-ENT-TUTAR11       PIC S9(16)V99.
    03 S-ENT-TUTAR12       PIC S9(16)V99.
    03 S-ENT-KOMISYON      PIC S9(16)V99.
    03 S-ENT-DOVIZ-MIKTARI PIC S9(16)V99.
    03 BCOUNT              PIC 9(3).
    03 DEF-FIS-ACIKLAMA    PIC X(255).
    03 V-FIS-ACIKLAMA.
       05 LEN              PIC S9(04) COMP.
       05 VAL              PIC X(255).
    03 V-IND-FIS-ACIKLAMA  PIC S9(04) COMP.
    03 V-FIS-IPTAL-ACIKLAMA.
       05 LEN                   PIC S9(04) COMP.
       05 VAL                   PIC X(255).
    03 V-IND-FIS-IPTAL-ACIKLAMA PIC S9(04) COMP.
    03 DEF-DEK-ACIKLAMA   PIC X(100).
    03 V-DEK-ACIKLAMA.
       05 LEN              PIC S9(04) COMP.
       05 VAL              PIC X(100).
    03 V-IND-DEK-ACIKLAMA PIC S9(04) COMP.

 EXEC SQL END DECLARE SECTION END-EXEC.

    EXEC SQL
      DECLARE SELECT_MFYS  CURSOR FOR
      SELECT IOMERKEZ_NO,0,555,
             IOISLEM_TURU,IOPARA_TURU,IOPARA_KURU,
      CASE
        WHEN IOISLEM_TURU LIKE "4%"   THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "51%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "52%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "53%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "61%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "861%" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "12%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "22%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "71%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
  WHEN IOISLEM_TURU IN ("8668","3383","3384","3385","7343","7372","7346","7406","7426","7338"
                       ,"7339")
                              THEN   SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "63%"  THEN SUM(IOTUTAR)
        ELSE                          SUM((IOCARPAN - 1) * IOTUTAR)
      END,
      CASE
      WHEN IOISLEM_TURU IN ("1200", "1210","2200" ,"5100","5200", "5300", "6100" ,"8610" ,"7100","7101")
       THEN SUM((IOCARPAN - 1) * IOTUTAR1)*(-1)
       ELSE SUM((IOCARPAN - 1) * IOTUTAR1)
       END,
       CASE
       WHEN IOISLEM_TURU IN ( "5100", "5200", "5300", "7100" ,"7101" ,"1200", "2200" )
            THEN SUM((IOCARPAN - 1) * IOTUTAR2)*(-1)
            ELSE SUM((IOCARPAN - 1) * IOTUTAR2)
       END,
       CASE IOISLEM_TURU
           WHEN "5100" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "5200" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "5300" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "7100" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "7101" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR3)
       END,
       CASE IOISLEM_TURU
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR4)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR4)*(-1)
           WHEN "6100" THEN SUM((IOCARPAN - 1) * IOTUTAR4)*(-1)
           WHEN "8610" THEN SUM((IOCARPAN - 1) * IOTUTAR4)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR4)
       END,
       CASE IOISLEM_TURU
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR5)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR5)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR5)
       END,
       CASE IOISLEM_TURU
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR6)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR6)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR6)
       END,
       CASE IOISLEM_TURU
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR7)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR7)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR7)
       END,
       CASE IOISLEM_TURU
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR8)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR8)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR8)
       END,
       CASE IOISLEM_TURU
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR9)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR9)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR9)
       END,
       CASE IOISLEM_TURU
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR10)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR10)*(-1)
           WHEN "7200" THEN SUM((IOCARPAN - 1) * IOTUTAR10)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR10)
       END,
       CASE IOISLEM_TURU
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR11)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR11)*(-1)
           WHEN "7200" THEN SUM((IOCARPAN - 1) * IOTUTAR11)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR11)
       END,
       CASE IOISLEM_TURU
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR12)*(-1)
           WHEN "2200" THEN SUM((IOCARPAN - 1) * IOTUTAR12)*(-1)
           WHEN "7200" THEN SUM((IOCARPAN - 1) * IOTUTAR12)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR12)
       END,
     CASE
        WHEN IOISLEM_TURU LIKE "4%"   THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "51%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "52%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "53%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "61%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "861%" THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "12%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "22%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "71%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
 WHEN IOISLEM_TURU IN ("8668","3383","3384","3385","7343","7372","7346","7406","7426","7338"
                      ,"7339")
                              THEN   SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "63%"  THEN SUM (IOADET)
        ELSE SUM (IOADET*(IOCARPAN - 1 ))
      END
      FROM =MFYS
      WHERE IOYIL        = :S-ISLEM-YY  AND
            IOAY         = :S-ISLEM-MM  AND
            IOGUN        = :S-ISLEM-DD  AND
            IOMERKEZ_NO  = :S-MERKEZ-NO AND
     (CASE
        WHEN IOISLEM_TURU LIKE "4%"   THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "51%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "52%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "53%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "61%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "861%" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "12%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "22%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "71%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "3383"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "3384"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "3385"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "8668"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "7343"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "7346"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "7338"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "7339"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "7372"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "7406"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "7426"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "63%"  THEN SUM(IOTUTAR)
        ELSE SUM((IOCARPAN - 1) * IOTUTAR)
      END > 0 OR IOISLEM_TURU = "7200" OR IOISLEM_TURU = "2100" )
        and ioislem_turu <> "2800"
        and ioislem_turu not in ("7439","7443","7440","7441","7442")
        and ioislem_turu <> "7336"
      and ioislem_turu not in
      (select islem_turu from $data20.sezer.islkapt
       where islem_turu < "5400" browse access)
     GROUP BY 1,2,3,4,5,6
     browse access
  UNION ALL
     SELECT IOMERKEZ_NO,0,555,
            IOISLEM_TURU, CASE  PARA_TURU
                                WHEN "YTL" THEN "TL "
                                WHEN "TL " THEN "TL "
                                WHEN "USD" THEN "USD"
                                WHEN "EUR" THEN "EUR"
                           END, 1 ,
     CASE
        WHEN IOISLEM_TURU LIKE "4%"   THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "51%"  THEN 0
        WHEN IOISLEM_TURU LIKE "52%"  THEN 0
        WHEN IOISLEM_TURU LIKE "53%"  THEN 0
        WHEN IOISLEM_TURU LIKE "61%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "861%" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "12%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "22%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "71%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "7372" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "7406" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "7426" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "8668"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "8718"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "8719"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "8993"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU = "3719"    THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "63%"  THEN SUM(IOTUTAR)
        ELSE SUM((IOCARPAN - 1) * IOTUTAR)
      END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR1)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR1)*(-1)
           WHEN "1210" THEN SUM((IOCARPAN - 1) * IOTUTAR1)*(-1)
           WHEN "5100" THEN SUM((IOCARPAN - 1) * IOTUTAR1)*(-1)
           WHEN "5200" THEN SUM((IOCARPAN - 1) * IOTUTAR1)*(-1)
           WHEN "5300" THEN SUM((IOCARPAN - 1) * IOTUTAR1)*(-1)
           WHEN "7100" THEN SUM((IOCARPAN - 1) * IOTUTAR1)*(-1)
           WHEN "7101" THEN SUM((IOCARPAN - 1) * IOTUTAR1)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR1)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR2)*(-1)
           WHEN "5100" THEN SUM((IOCARPAN - 1) * IOTUTAR2)*(-1)
           WHEN "5200" THEN SUM((IOCARPAN - 1) * IOTUTAR2)*(-1)
           WHEN "5300" THEN SUM((IOCARPAN - 1) * IOTUTAR2)*(-1)
           WHEN "7100" THEN SUM((IOCARPAN - 1) * IOTUTAR2)*(-1)
           WHEN "7101" THEN SUM((IOCARPAN - 1) * IOTUTAR2)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR2)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR2)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "5100" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "5200" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "5300" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "7100" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           WHEN "7101" THEN SUM((IOCARPAN - 1) * IOTUTAR3)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR3)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR4)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR4)*(-1)
           WHEN "6100" THEN SUM((IOCARPAN - 1) * IOTUTAR4)*(-1)
           WHEN "8610" THEN SUM((IOCARPAN - 1) * IOTUTAR4)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR4)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR5)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR5)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR5)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR6)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR6)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR6)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR7)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR7)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR7)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR8)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR8)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR8)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR9)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR9)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR9)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR10)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR10)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR10)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR11)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR11)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR11)
       END,
       CASE IOISLEM_TURU
           WHEN "4202" THEN SUM((IOCARPAN - 1) * IOTUTAR12)*(-1)
           WHEN "1200" THEN SUM((IOCARPAN - 1) * IOTUTAR12)*(-1)
           ELSE SUM((IOCARPAN - 1) * IOTUTAR12)
       END,
     CASE
        WHEN IOISLEM_TURU LIKE "4%"   THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "51%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "52%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "53%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "61%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "861%" THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "12%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "22%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "71%"  THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "7372" THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "7406" THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "7426" THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))
        WHEN IOISLEM_TURU LIKE "63%"  THEN SUM (IOADET)
        WHEN IOISLEM_TURU IN ("8993","8668" )   THEN SUM (IOADET*(IOCARPAN - 1 )*(-1))

        ELSE SUM (IOADET*(IOCARPAN - 1 ))
      END
    FROM =OZETLSTY
     WHERE IOYIL        = :S-ISLEM-YY AND
           IOAY         = :S-ISLEM-MM AND
           IOGUN        = :S-ISLEM-DD AND
          (
           IOGISE_NO    <> 0 or
           (IOGISE_NO   = 0 AND
            CAST(SUBSTRING (IOISLEM_TURU FROM 2 FOR 3) AS INTEGER) IN
            (SELECT KURUM_KODU FROM $DATA28.MRKTAB.GELIR
             WHERE TARIH = :S-ISLEM-YY * 10000 +
                           :S-ISLEM-MM * 100   +
                           :S-ISLEM-DD
             BROWSE ACCESS))
           )
              AND
           IOSUBE_NO    NOT IN (99,2)         AND
          IOMERKEZ_NO = :S-MERKEZ-NO  AND
          (PARA_TURU = "TL " OR PARA_TURU = "YTL" OR PARA_TURU = "TRL") AND
           IOISLEM_TURU NOT LIKE "71%"                                  AND
*           IOISLEM_TURU <> "7200"                                       AND
*           IOISLEM_TURU <> "1400"                                       AND
*           IOISLEM_TURU <> "1210"                                       AND
*           IOISLEM_TURU <> "4609"                                       and
*           IOISLEM_TURU <> "3866"                                       and
*     ioislem_turu in (       "2100") and
*EVRENSEL HESABA GECINCE 3866 YA AIT 153.34 HESAP SILINDIGI ICIN MUHASEBE
*DAIRESI MANUEL GIRILMESINI ISTEDI.BU YUZDEN NOT IN YAPTIK.04.06.2014
*----meho
     ioislem_turu not in ("7200","1400","1210","4609" ,"3771","3866","3938",
     "5501","5503","3012","3920","3295","7379","7336","6300","7439","7443",
       "7440","7441","7442")
       and ioislem_turu not in
       (select islem_turu from $data20.sezer.islkapt
        where islem_turu < "5400" browse access) and
*----meho
      CASE
        WHEN IOISLEM_TURU LIKE "4%"   THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "51%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "52%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "53%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "61%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "861%" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "12%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "22%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "71%"  THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "7372" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "7406" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "7426" THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        WHEN IOISLEM_TURU LIKE "63%"  THEN SUM(IOTUTAR)
    WHEN IOISLEM_TURU IN ("8993","8668" )   THEN SUM((IOCARPAN - 1) * IOTUTAR)*(-1)
        ELSE SUM((IOCARPAN - 1) * IOTUTAR)
      END > 0
    GROUP BY 1,2,3,4,5,6
    ORDER BY 1,2,3,4,5,6
   BROWSE ACCESS
 END-EXEC.

    EXEC SQL
      DECLARE SELECT_HESPLYAN CURSOR FOR
      SELECT GMU_HESAP_NO_REF_NO,GMU_HESAP_FROM_REF_NO,
             GMU_HESAP_TO_REF_NO
       FROM  $DATA18.MUHTAB.HESPLYAN
       WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU  OF D-HESPLYAN
       ORDER BY 1,2,3
      BROWSE ACCESS
    END-EXEC.

    EXEC SQL
      DECLARE SELECT_REF_NO CURSOR FOR
      SELECT GMU_HESAP_REF_NO,GMU_BAKIYE_DURUMU
      FROM =HESPLANI
      WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-HESPLAN AND
            GMU_DETAY_DURUMU = "A"                            AND
                  GMU_HESAP1 = :GMU-HESAP1       OF D-HESPLAN AND
                  GMU_HESAP2 = :GMU-HESAP2       OF D-HESPLAN AND
                  GMU_HESAP3 = :GMU-HESAP3       OF D-HESPLAN
      BROWSE ACCESS
    END-EXEC.

*    EXEC SQL
*      DECLARE SELECT_USER CURSOR FOR
*      SELECT SUBE_NO,GISE_NO
*       FROM  $DATA21.muhtab.user
*       WHERE KURULUS_KODU = :KURULUS-KODU OF D-USER AND
*               BOLGE_KODU = :BOLGE-KODU   OF D-USER AND
*                MERKEZ_NO = :MERKEZ-NO    OF D-USER
*       ORDER BY 1,2
*      BROWSE ACCESS
*    END-EXEC.

    EXEC SQL
      DECLARE SELECT_MERKEZ_NO CURSOR FOR
      SELECT B.BOLGE_KODU,A.MERKEZ_NO
       FROM  =KURUMMRK A, =PTTMRK       B
**     FROM $DATA15.EMTABLO.KURUMTUM A, =PTTMRK       B
       WHERE A.MERKEZ_NO = B.MERKEZ_NO  AND
             a.merkez_no NOT IN (8813)  AND
             A.MERKEZ_NO < 40000        AND
             BOLGE_KODU  not in (200)
*            and a.merkez_no=11502
*           and a.merkez_no in
*         (12724)
*         (11502,11585,09852,08870,05934,00372,00638 ,10918    )
*      and   a.merkez_no not in (select merkez_no from $data21.siltab.silkms
*            browse access)
**tikkat tikkat
**01.07.2012'den PID BASMUDURLUKLERI kapatildigi icin asagidaki bolge
**kodlari cikarildi.
     AND BOLGE_KODU NOT IN (135,206,234,334)
       GROUP BY 1,2
       ORDER BY 1,2
      BROWSE ACCESS
    END-EXEC.
*
 PROCEDURE DIVISION.
*
 H00-MAIN SECTION.

    INITIALIZE OK-MSG, S-VARIAB-INIT, D-HESPLAN, D-FBASLIK, WS-VARIAB-INIT,
               D-PARAM, D-FDETAY, WS-SUBPROG-VARIAB, WS-PARAMETER-HATA,
               WS-PARAMETER-FLAG,  D-DONKAPA,
               D-OZETHES,
               D-ISLEMID, D-HESPLYAN, D-ERRLOG, D-OZET, D-ENTEG,
               D-ISLEMTUR, D-ODEKOD, D-PTTMRK, D-ENTSONUC, D-KURUMMRK,
               WS-ENTEG-MERKEZ-ADET, D-ERRLOG
    REPLACING ALPHANUMERIC BY SPACES NUMERIC BY ZEROES.

    EXEC SQL BEGIN WORK END-EXEC.

    PERFORM SELECT-PARAMETRE-HESAP.
    IF OK-MSG = 0 AND OK-MESSAGE = 0
       PERFORM SELECT-MERKEZ-NO
    END-IF.
    IF NOT WS-TRANSACTION-BITIR-FLAG
       EXEC SQL COMMIT WORK END-EXEC
    END-IF.

    IF OK-MSG = 0 AND OK-MESSAGE = 0
       PERFORM ENTEGRASYON-YAP
    END-IF.

    IF OK-MSG = 0
       MOVE "0000" TO WS-RESPONSE-CODE
       MOVE "00"   TO WS-RESPONSE-COUNTER
    END-IF.

***ENTER TAL "ENDTRANSACTION".

 H00-MAIN-EXIT.
   STOP RUN.

********************************************************************************
 SELECT-PARAMETRE-HESAP SECTION.

  MOVE "=PARAMETR"     TO WS-HATA-TABLE-NAME
  MOVE WS-KURULUS-KODU TO GMU-KURULUS-KODU  OF D-PARAM
* MOVE "G00"           TO GMU-PARAMETRE-KEY OF D-PARAM


*   EXEC SQL
*     SELECT GMU_NAKIT_KASA_REF,GMU_DOVIZ_KASA_REF
*     INTO :GMU-NAKIT-KASA-REF OF D-PARAM,
*              :GMU-DOVIZ-KASA-REF OF D-PARAM
*         FROM =PARAMETR
*     WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-PARAM AND
*          GMU_PARAMETRE_KEY = :GMU-PARAMETRE-KEY OF D-PARAM
*     BROWSE ACCESS
*   END-EXEC.
*   EVALUATE SQLCODE OF SQLCA
*   WHEN 0
*     CONTINUE
*   WHEN 100
*     MOVE "5990"        TO WS-RESPONSE-CODE
*     MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
*     MOVE "01"          TO WS-RESPONSE-COUNTER
*     PERFORM HATA-VER-WORK
*     GO TO SELECT-PARAMETRE-HESAP-EXIT
*   WHEN OTHER
*     MOVE "5990"        TO WS-RESPONSE-CODE
*     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
*     SET WS-FATAL-ERROR TO TRUE
*     MOVE "02"          TO WS-RESPONSE-COUNTER
*     PERFORM HATA-VER-WORK
*     GO TO SELECT-PARAMETRE-HESAP-EXIT
*   END-EVALUATE.

*simdi de atm icin gerekli hesaplar select ediliyor.

  MOVE "G02"           TO GMU-PARAMETRE-KEY OF D-PARAM

   EXEC SQL
     SELECT GMU_DOVIZ_DEGERLEME_HESAP_REF,
                GMU_BM_290_HESAP_REF,
                        GMU_DOVIZ_KAR_HESAP_REF
     INTO :S-ATM-TEDIYE-HESAP,
          :S-ATM-TAHSIL-HESAP,
                  :S-ATM-AKTAR-HESAP
         FROM =PARAMETR
     WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-PARAM AND
          GMU_PARAMETRE_KEY = :GMU-PARAMETRE-KEY OF D-PARAM
     BROWSE ACCESS
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
   WHEN 0
     CONTINUE
   WHEN 100
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
     MOVE "03"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
     GO TO SELECT-PARAMETRE-HESAP-EXIT
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "04"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
     GO TO SELECT-PARAMETRE-HESAP-EXIT
   END-EVALUATE.

*þimdi de bsmv için gerekli hesaplar select ediliyor.

 MOVE "G05"           TO GMU-PARAMETRE-KEY OF D-PARAM

 EXEC SQL
     SELECT GMU_MDV_ARTIS_HESABI_REF,GMU_NAKIT_KASA_REF
     INTO :S-BSMV-HESAP-740,
          :S-BSMV-HESAP-360
     FROM $DATA18.muhtab.parametr
     WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-PARAM AND
          GMU_PARAMETRE_KEY = :GMU-PARAMETRE-KEY OF D-PARAM
     BROWSE ACCESS
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
   WHEN 0
     CONTINUE
   WHEN 100
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
     MOVE "03"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
     GO TO SELECT-PARAMETRE-HESAP-EXIT
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "04"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
     GO TO SELECT-PARAMETRE-HESAP-EXIT
   END-EVALUATE.


 SELECT-PARAMETRE-HESAP-EXIT.
     EXIT.
******************************************************************************
 SELECT-MERKEZ-NO SECTION.

  MOVE "=KURUMMRK"         TO WS-HATA-TABLE-NAME
  MOVE "SELECT_MERKEZ_NO"  TO WS-HATA-CURSOR-NAME

    EXEC SQL OPEN SELECT_MERKEZ_NO END-EXEC.
    IF SQLCODE OF SQLCA NOT EQUAL 0
       MOVE "5990"           TO WS-RESPONSE-CODE
       MOVE "COULD-NOT-OPEN" TO WS-HATA-MESAJI-TIPI
       MOVE "05"             TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK
       GO TO ENTEGRASYON-YAP-EXIT
    END-IF

   PERFORM WITH TEST BEFORE VARYING K-SAY FROM 1 BY 1 UNTIL  DON-MSG = 1 OR
                                                             OK-MSG  = 1
   EXEC SQL
     FETCH SELECT_MERKEZ_NO INTO
        :BOLGE-KODU  OF D-PTTMRK,
        :MERKEZ-NO   OF D-KURUMMRK
   END-EXEC
   EVALUATE SQLCODE OF SQLCA
   WHEN 0
     MOVE MERKEZ-NO  OF D-KURUMMRK TO WS-ENTEG-MERKEZ-NO(K-SAY)
     MOVE BOLGE-KODU OF D-PTTMRK   TO WS-ENTEG-BOLGE-KODU(K-SAY)
     ADD 1 TO WS-ADET-MERKEZ
     ADD 1 TO WS-ENTEG-MERKEZ-ADET
   WHEN 100
     MOVE 1 TO DON-MSG
     IF WS-ADET-MERKEZ = 0
       MOVE "5990"        TO WS-RESPONSE-CODE
       MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
       MOVE "06"          TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK
       MOVE 1 TO OK-MESSAGE
     END-IF
   WHEN OTHER
     MOVE 1 TO DON-MSG
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "07"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
     MOVE 1 TO OK-MESSAGE
   END-EVALUATE
  END-PERFORM.

  EXEC SQL CLOSE SELECT_MERKEZ_NO END-EXEC.

 SELECT-MERKEZ-NO-EXIT.
      EXIT.
*****************************************************************************
 ENTEGRASYON-YAP SECTION.

*  DISPLAY "ARALIK AYININ HANGI GUNU ICIN ENTEGRASYON YAPIYORSUNUZ?"
*  WITH NO ADVANCING
*  ACCEPT s-islem-tarihi

*  move s-islem-tarihi to ws-islem-tarihi

  MOVE WS-ENTEG-MERKEZ-ADET TO WS-MERKEZ-ADET
  PERFORM WITH TEST BEFORE VARYING K-SAY FROM 1 BY 1 UNTIL K-SAY >

                                                           WS-MERKEZ-ADET
**                                                      or ok-msg = 1

  MOVE "=OZETLSTY"                TO WS-HATA-TABLE-NAME
  MOVE "SELECT_MFYS"              TO WS-HATA-CURSOR-NAME
  MOVE WS-ENTEG-MERKEZ-NO(K-SAY)  TO S-MERKEZ-NO
  MOVE WS-ENTEG-BOLGE-KODU(K-SAY) TO S-BOLGE-KODU
**a‡
  MOVE FUNCTION CURRENT-DATE(1:8) TO WS-GUNUN-TARIHI
  MOVE FUNCTION INTEGER-OF-DATE (WS-GUNUN-TARIHI) TO WS-ISLEM-TARIHI-INTEGER
  COMPUTE WS-ISLEM-TARIHI-INTEGER = WS-ISLEM-TARIHI-INTEGER - 1
  MOVE FUNCTION DATE-OF-INTEGER (WS-ISLEM-TARIHI-INTEGER) TO WS-ISLEM-TARIHI
  MOVE WS-ISLEM-YIL TO S-ISLEM-YY
  MOVE WS-ISLEM-AY  TO S-ISLEM-MM
  MOVE WS-ISLEM-GUN TO S-ISLEM-DD
*a‡
* MOVE 2015         TO S-ISLEM-YY
* MOVE 12           TO S-ISLEM-MM
* MOVE 19           TO S-ISLEM-DD
* move 20151219        to ws-islem-tarihi

  move ws-islem-tarihi to s-islem-tarihi



**-----------------------
* DISPLAY "ARALIK AYININ HANGI GUNU ICIN ENTEGRASYON YAPIYORSUNUZ?"
* WITH NO ADVANCING
* ACCEPT s-islem-tarihi
* move s-islem-tarihi to ws-islem-tarihi
**-----------------------


  INITIALIZE WS-FLAG10, WS-FLAG11, WS-FLAG12, DON-MSG, WS-ADET, OK-MSG,
             OK-MSG-ENT, WS-FLAG9

   EXEC SQL BEGIN WORK END-EXEC

    EXEC SQL OPEN SELECT_MFYS END-EXEC
    IF SQLCODE OF SQLCA NOT EQUAL 0
       MOVE "5990"           TO WS-RESPONSE-CODE
       MOVE "COULD-NOT-OPEN" TO WS-HATA-MESAJI-TIPI
       MOVE "05"             TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK
       GO TO ENTEGRASYON-YAP-EXIT
    ELSE
       SET WS-CURSOR-ACIK-FLAG TO TRUE
    END-IF

   PERFORM WITH TEST BEFORE VARYING J-SAY FROM 1 BY 1 UNTIL  DON-MSG = 1 OR
                                                             OK-MSG  = 1
   EXEC SQL
     FETCH SELECT_MFYS INTO
        :IOMERKEZ-NO   OF D-OZET,
        :IOSUBE-NO     OF D-OZET,
        :IOGISE-NO     OF D-OZET,
        :IOISLEM-TURU  OF D-OZET,
        :PARA-TURU     OF D-OZET,
        :PARA-KURU     OF D-OZET,
        :IOTUTAR       OF D-OZET,
        :IOTUTAR1      OF D-OZET,
        :IOTUTAR2      OF D-OZET,
        :IOTUTAR3      OF D-OZET,
        :IOTUTAR4      OF D-OZET,
        :IOTUTAR5      OF D-OZET,
        :IOTUTAR6      OF D-OZET,
        :IOTUTAR7      OF D-OZET,
        :IOTUTAR8      OF D-OZET,
        :IOTUTAR9      OF D-OZET,
        :IOTUTAR10     OF D-OZET,
        :IOTUTAR11     OF D-OZET,
        :IOTUTAR12     OF D-OZET,
        :IOADET        OF D-OZET
   END-EXEC
   EVALUATE SQLCODE OF SQLCA
   WHEN 0
    MOVE 1 TO WS-KAYITVAR-FLAG
     IF PARA-TURU OF D-OZET = "YTL"
        MOVE "TL " TO PARA-TURU OF D-OZET
     END-IF
**merkezin entegrasyonu sirasinda herhangi bir gise icin hata almissa
**diger giseler icin de entegrasyon yapilmiyor, daha sonra sonuc raporuna
**bakilip merkezin tüm giseleri icin tekrar entegrasyon calistirilmasi
**gerekiyor.
     PERFORM MFYS-ENTEGRASYON
     IF OK-MSG-ENT = 0
        ADD 1 TO WS-ADET
        INITIALIZE D-ENTEG
     ELSE
        EXIT PERFORM
     END-IF
   WHEN 100
     MOVE 1 TO DON-MSG
     EXEC SQL CLOSE SELECT_MFYS END-EXEC
     IF WS-ADET = 0
       MOVE "5990"        TO WS-RESPONSE-CODE
       MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
       MOVE "06"          TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK


     END-IF
   WHEN OTHER
     EXEC SQL CLOSE SELECT_MFYS END-EXEC
     MOVE 1 TO DON-MSG
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "07"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   END-EVALUATE
  END-PERFORM

    IF NOT WS-TRANSACTION-BITIR-FLAG
       EXEC SQL COMMIT WORK END-EXEC
    END-IF

*** MARK-MERKEZ-ENT-BITIR
    PERFORM INSERT-SONUC-RAPOR

 END-PERFORM.

 ENTEGRASYON-YAP-EXIT.
      EXIT.
*****************************************************************************
 MFYS-ENTEGRASYON SECTION.

*islemtur tablosundaki muh_hes_ref_no,muh_hes_ref_no1........
*kolonlari postanet2004 tarafinda merkezlerin muhasebe dokumlerini
*aldiklari =ozetlsty ve mfys entegrasyon islemleri icin kullanilan
*=mfys tablosundan yapilan select sonucundaki iotutar,iotutar1,iotutar2...
*kolonlarindaki tutarlarin hangi muhasebe hesaplarina yansitilacagini
*gosterir.

   INITIALIZE D-ISLEMTUR, WS-FLAG7, WS-FLAG8, WS-FLAG12
   MOVE IOISLEM-TURU OF D-OZET TO ISLEM-TURU OF D-ISLEMTUR
   MOVE PARA-TURU    OF D-OZET TO PARA-TURU  OF D-ISLEMTUR
   PERFORM SELECT-ISLEMTUR
   IF CARPAN OF D-ISLEMTUR NOT EQUAL 1
      CONTINUE
   ELSE
      GO TO MFYS-ENTEGRASYON-EXIT
   END-IF.

   IF KOMISYON OF D-ISLEMTUR = 0
      MOVE "5921"    TO WS-RESPONSE-CODE
      STRING ISLEM-TURU OF D-ISLEMTUR " ÝÞLEM TÜRÜNE AÝT "
      DELIMITED BY SIZE
      "KOMÝSYON ORANÝNDA SORUN VAR, LÜTFEN KONTROL EDÝNÝZ!"
      DELIMITED BY SIZE INTO WS-HATA-MESAJI
      MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
      MOVE "08"      TO WS-RESPONSE-COUNTER
      PERFORM HATA-VER-WORK
      GO TO MFYS-ENTEGRASYON-EXIT
   END-IF.

   MOVE S-ISLEM-YY                 TO ENT-ISLEM-YIL   OF D-ENTEG
   MOVE S-ISLEM-MM                 TO ENT-ISLEM-AY    OF D-ENTEG
   MOVE S-ISLEM-DD                 TO ENT-ISLEM-GUN   OF D-ENTEG
   MOVE S-BOLGE-KODU               TO ENT-BOLGE-KODU  OF D-ENTEG
   MOVE IOMERKEZ-NO OF D-OZET      TO ENT-MERKEZ-NO   OF D-ENTEG
   MOVE IOSUBE-NO   OF D-OZET      TO ENT-SUBE-NO     OF D-ENTEG
   MOVE IOGISE-NO   OF D-OZET      TO ENT-GISE-NO     OF D-ENTEG
   MOVE FUNCTION CURRENT-DATE(1:4) TO ENT-SISTEM-YIL  OF D-ENTEG
   MOVE FUNCTION CURRENT-DATE(5:2) TO ENT-SISTEM-AY   OF D-ENTEG
   MOVE FUNCTION CURRENT-DATE(7:2) TO ENT-SISTEM-GUN  OF D-ENTEG
   MOVE FUNCTION CURRENT-DATE(9:8) TO ENT-SISTEM-SAAT OF D-ENTEG

*******************
*1-TAHSILAT       *
*2-TEDIYE         *
*3-ATM TAHSILAT   *
*4-ATM TEDIYE     *
*******************

    IF IOISLEM-TURU OF D-OZET > "8000"
    MOVE WS-ATM-FIS-ACIKLAMA TO WS-FIS-ACIKLAMA
       IF CARPAN OF D-ISLEMTUR = 2
          MOVE 3 TO ENT-ISLEM-TIPI OF D-ENTEG
       ELSE
          IF CARPAN OF D-ISLEMTUR = 0
             MOVE 4 TO ENT-ISLEM-TIPI OF D-ENTEG
          END-IF
       END-IF
    ELSE
    MOVE WS-GISE-FIS-ACIKLAMA TO WS-FIS-ACIKLAMA
       IF CARPAN OF D-ISLEMTUR = 2
          MOVE 1 TO ENT-ISLEM-TIPI OF D-ENTEG
       ELSE
          IF CARPAN OF D-ISLEMTUR = 0
             MOVE 2 TO ENT-ISLEM-TIPI OF D-ENTEG
          END-IF
       END-IF
    END-IF


   MOVE IOTUTAR     OF D-OZET      TO S-ENT-TUTAR
   MOVE IOTUTAR1    OF D-OZET      TO S-ENT-TUTAR1
   MOVE IOTUTAR2    OF D-OZET      TO S-ENT-TUTAR2
   MOVE IOTUTAR3    OF D-OZET      TO S-ENT-TUTAR3
   MOVE IOTUTAR4    OF D-OZET      TO S-ENT-TUTAR4
   MOVE IOTUTAR5    OF D-OZET      TO S-ENT-TUTAR5
   MOVE IOTUTAR6    OF D-OZET      TO S-ENT-TUTAR6
   MOVE IOTUTAR7    OF D-OZET      TO S-ENT-TUTAR7
   MOVE IOTUTAR8    OF D-OZET      TO S-ENT-TUTAR8
   MOVE IOTUTAR9    OF D-OZET      TO S-ENT-TUTAR9
   MOVE IOTUTAR10   OF D-OZET      TO S-ENT-TUTAR10
   MOVE IOTUTAR11   OF D-OZET      TO S-ENT-TUTAR11
   MOVE IOTUTAR12   OF D-OZET      TO S-ENT-TUTAR12
   MOVE IOADET      OF D-OZET      TO ENT-ISLEM-ADET OF D-ENTEG

*herhangi bir kuruma ait tahsilat parasinin tamami degil komisyonu
*dusulup kalan tutar ilgili hesapta muhasebelesiyorsa

   IF KOMISYON OF D-ISLEMTUR < 100
      COMPUTE S-ENT-KOMISYON ROUNDED = IOTUTAR OF D-OZET *
                                    ((100 - KOMISYON OF D-ISLEMTUR) / 100)
      COMPUTE S-ENT-TUTAR ROUNDED = IOTUTAR OF D-OZET - S-ENT-KOMISYON
      SET WS-KOMISYON-VAR-FLAG TO TRUE
   ELSE
      MOVE IOTUTAR OF D-OZET TO S-ENT-TUTAR
      MOVE 0                 TO S-ENT-KOMISYON
   END-IF.

   IF IOISLEM-TURU OF D-OZET = "2100" AND NOT PARA-TURU OF D-OZET = "TL "
      COMPUTE S-ENT-TUTAR ROUNDED = IOTUTAR  OF D-OZET + IOTUTAR2 OF D-OZET
      COMPUTE S-ENT-TUTAR5 ROUNDED = S-ENT-TUTAR * PARA-KURU OF D-OZET
   END-IF.

*  IF IOISLEM-TURU OF D-OZET = "2100" AND NOT (PARA-TURU OF D-OZET = "TL ")
*     COMPUTE S-ENT-TUTAR2 ROUNDED = IOTUTAR5 OF D-OZET * (0.28)
*     COMPUTE S-ENT-TUTAR5 ROUNDED = IOTUTAR5 - (IOTUTAR5 OF D-OZET * (0.28))
*  END-IF.

   IF IOISLEM-TURU OF D-OZET = "2100" AND NOT (PARA-TURU OF D-OZET = "TL ")
      COMPUTE S-ENT-TUTAR2 ROUNDED = (IOTUTAR2 OF D-OZET * (0.28) ) *
                                      PARA-KURU OF D-OZET
      COMPUTE S-ENT-TUTAR5 ROUNDED = ((IOTUTAR2 - (IOTUTAR2 * (0.28))) *
                                      PARA-KURU OF D-OZET )
   END-IF.

   IF IOISLEM-TURU OF D-OZET = "2100" AND PARA-TURU OF D-OZET = "TL "
      COMPUTE S-ENT-TUTAR2 ROUNDED = IOTUTAR2 OF D-OZET * (0.28)
      COMPUTE S-ENT-TUTAR5 ROUNDED = IOTUTAR2 - (IOTUTAR2 OF D-OZET * (0.28))
   END-IF.

   IF IOISLEM-TURU OF D-OZET = "2200" AND
     (PARA-TURU OF D-OZET = "YTL" OR
      PARA-TURU OF D-OZET = "TRL" OR
      PARA-TURU OF D-OZET = "TL " )
      MOVE 0 TO IOTUTAR OF D-OZET, S-ENT-TUTAR
   END-IF.

   IF IOISLEM-TURU OF D-OZET = "7200" AND PARA-TURU OF D-OZET = "TL "
      COMPUTE S-ENT-TUTAR7 ROUNDED = (IOTUTAR7 OF D-OZET -
                                      IOTUTAR10 OF D-OZET) * (0.50)
      COMPUTE S-ENT-TUTAR2 ROUNDED = IOTUTAR2 OF D-OZET - S-ENT-TUTAR7
      MOVE 0 TO IOTUTAR10 OF D-OZET, S-ENT-TUTAR10
   END-IF.

   IF IOISLEM-TURU OF D-OZET = "3286"
      MOVE 0 TO IOTUTAR1  OF D-OZET, S-ENT-TUTAR1
      MOVE 0 TO IOTUTAR2  OF D-OZET, S-ENT-TUTAR2
      MOVE 0 TO IOTUTAR3  OF D-OZET, S-ENT-TUTAR3
      MOVE 0 TO IOTUTAR4  OF D-OZET, S-ENT-TUTAR4
      MOVE 0 TO IOTUTAR5  OF D-OZET, S-ENT-TUTAR5
      MOVE 0 TO IOTUTAR6  OF D-OZET, S-ENT-TUTAR6
      MOVE 0 TO IOTUTAR7  OF D-OZET, S-ENT-TUTAR7
      MOVE 0 TO IOTUTAR8  OF D-OZET, S-ENT-TUTAR8
      MOVE 0 TO IOTUTAR9  OF D-OZET, S-ENT-TUTAR9
      MOVE 0 TO IOTUTAR10 OF D-OZET, S-ENT-TUTAR10
      MOVE 0 TO IOTUTAR11 OF D-OZET, S-ENT-TUTAR11
      MOVE 0 TO IOTUTAR12 OF D-OZET, S-ENT-TUTAR12
   END-IF.

   IF IOISLEM-TURU OF D-OZET = "3142" OR
      IOISLEM-TURU OF D-OZET = "3148" OR
      IOISLEM-TURU OF D-OZET = "3169" OR
      IOISLEM-TURU OF D-OZET = "3334"
      MOVE 0 TO IOTUTAR1  OF D-OZET, S-ENT-TUTAR1
      MOVE 0 TO IOTUTAR2  OF D-OZET, S-ENT-TUTAR2
      MOVE 0 TO IOTUTAR3  OF D-OZET, S-ENT-TUTAR3
      MOVE 0 TO IOTUTAR4  OF D-OZET, S-ENT-TUTAR4
      MOVE 0 TO IOTUTAR5  OF D-OZET, S-ENT-TUTAR5
      MOVE 0 TO IOTUTAR6  OF D-OZET, S-ENT-TUTAR6
      MOVE 0 TO IOTUTAR7  OF D-OZET, S-ENT-TUTAR7
      MOVE 0 TO IOTUTAR8  OF D-OZET, S-ENT-TUTAR8
      MOVE 0 TO IOTUTAR9  OF D-OZET, S-ENT-TUTAR9
      MOVE 0 TO IOTUTAR10 OF D-OZET, S-ENT-TUTAR10
      MOVE 0 TO IOTUTAR11 OF D-OZET, S-ENT-TUTAR11
      MOVE 0 TO IOTUTAR12 OF D-OZET, S-ENT-TUTAR12
   END-IF.

*  IF IOISLEM-TURU OF D-OZET = "7100" AND PARA-TURU OF D-OZET = "TL "
*     MOVE 0 TO IOTUTAR1 OF D-OZET, S-ENT-TUTAR1
*  END-IF.

   IF IOISLEM-TURU OF D-OZET = "5100" AND PARA-TURU OF D-OZET = "TL "
      MOVE 0 TO IOTUTAR2 OF D-OZET, S-ENT-TUTAR2
      MOVE 0 TO IOTUTAR3 OF D-OZET, S-ENT-TUTAR3
   END-IF.

*  IF IOISLEM-TURU OF D-OZET = "1100" AND NOT ( PARA-TURU OF D-OZET = "TL " )
*     MOVE 0 TO IOTUTAR2  OF D-OZET, S-ENT-TUTAR2
*     MOVE 0 TO IOTUTAR3  OF D-OZET, S-ENT-TUTAR3
*     MOVE 0 TO IOTUTAR4  OF D-OZET, S-ENT-TUTAR4
*     MOVE 0 TO IOTUTAR5  OF D-OZET, S-ENT-TUTAR5
*     MOVE 0 TO IOTUTAR6  OF D-OZET, S-ENT-TUTAR6
*     MOVE 0 TO IOTUTAR7  OF D-OZET, S-ENT-TUTAR7
*     MOVE 0 TO IOTUTAR8  OF D-OZET, S-ENT-TUTAR8
*     MOVE 0 TO IOTUTAR9  OF D-OZET, S-ENT-TUTAR9
*     MOVE 0 TO IOTUTAR10 OF D-OZET, S-ENT-TUTAR10
*     MOVE 0 TO IOTUTAR11 OF D-OZET, S-ENT-TUTAR11
*     MOVE 0 TO IOTUTAR12 OF D-OZET, S-ENT-TUTAR12
*  END-IF.


*burada ozet ve mfys tablosundan yapilan selectin sonucunda gelen cevaptaki
*iotutar,iotutar1,iotutar2..............iotutar12 kolonlarin hepsi icin
*sifirdan farkli ise mfys_entegrasyon tablosuna kayit insert edilmesi icin
*gerekli hesaplamalar yapiliyor.

 IF S-ENT-TUTAR NOT EQUAL 0
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
    if not (islem-turu of d-islemtur = "1210" or
            islem-turu of d-islemtur = "2100" or
            islem-turu of d-islemtur = "5100" or
            islem-turu of d-islemtur = "7100" or
            islem-turu of d-islemtur = "7200")
         DISPLAY " OZET TABLOSUNDAKI TUTAR KOLONUNDA DEGER OLDUGU HALDE "
         DISPLAY " ISLEMTUR TABLOSUNDAKI MUH-HES-REF-NO KOLONUNDA "
         DISPLAY " HESAP-NO BILGISI YOK. TUTAR KOLONUNDAKI DEGER ICIN "
         DISPLAY " MUHASEBELESTIRME YAPILMIYOR, TIKKAT TIKKAT! "
         DISPLAY " ISLEM TURU : " ISLEM-TURU OF D-ISLEMTUR
    end-if
    ELSE
           IF ISLEM-TURU OF D-ISLEMTUR = "5100" OR
               ISLEM-TURU OF D-ISLEMTUR = "5200" OR
               ISLEM-TURU OF D-ISLEMTUR = "5300"
           MOVE 2 TO CARPAN OF D-ISLEMTUR
           END-IF
       INITIALIZE D-HESPLAN
       MOVE MUH-HES-REF-NO OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
       IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
          MOVE MUH-HES-REF-NO1 TO GMU-HESAP-REF-NO OF D-HESPLAN
       END-IF
       PERFORM SELECT-HESAP-PLANI
*dvz       IF NOT (GMU-ODEME-KODU OF D-HESPLAN = "TRL" OR
*dvz               GMU-ODEME-KODU OF D-HESPLAN = "TL " OR
*dvz               GMU-ODEME-KODU OF D-HESPLAN = "YTL")
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
*         if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )

          MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
          IF IOISLEM-TURU OF D-OZET = "2100" AND
             NOT PARA-TURU OF D-OZET = "TL "
             COMPUTE ENT-TUTAR OF D-ENTEG ROUNDED = (IOTUTAR OF D-OZET +
                                                     IOTUTAR2 OF D-OZET) *
                                                     PARA-KURU OF D-OZET
          ELSE
             MOVE S-ENT-TUTAR1 TO ENT-TUTAR OF D-ENTEG
          END-IF
          MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
      IF  IOISLEM-TURU OF D-OZET  (1:1) = "8" or
          IOISLEM-TURU OF D-OZET  (1:1) = "3"
          PERFORM KONTROL-KONSINYE
     END-IF
*---------------------------------------------------------------*
*smart kart konsinye urun tablosunda tanimli olmamasina ragmen  *
*diger konsinye urunler gibi dvs'den satisi yapilacagindan      *
*ws-konsinye-flag true olarak set ediliyor ve muhasebe fisi     *
*olusturulmuyor.                                                *
*---------------------------------------------------------------*
          IF ENT-HESAP-REF-NO OF D-ENTEG = "153020000010" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000001" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000015" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000017" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000002" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000004" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000005" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000006" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000013" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000014" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000029" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000030" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "326020000004" OR
**altin hesaplari
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000017" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000018" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000019" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000020" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000021" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000022"
**altin hesaplari
             SET WS-KONSINYE-FLAG TO TRUE
          END-IF
          IF WS-KONSINYE-FLAG
             PERFORM INSERT-ENT-KONSINYE
             GO TO MFYS-ENTEGRASYON-EXIT
          ELSE
             PERFORM INSERT-ENTEGRS
          END-IF
          IF OK-MSG = 0 AND OK-MSG-ENT = 0
*         if  ENT-HESAP-REF-NO OF D-ENTEG (1:3) = "106"
*         if not (para-turu of d-ozet = "TRL" or
*                 para-turu of d-ozet = "TL " or
*                 para-turu of d-ozet = "YTL")
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
           IF CARPAN OF D-ISLEMTUR = 2
                  PERFORM MAHSUP-FISI-DVZ-TAHSIL
               else
                  PERFORM MAHSUP-FISI-DVZ-TEDIYE
               end-if
          else
*            move "100020000001" to s-kasa-hesap
             PERFORM FIS-ISLEMLERI
          end-if
          ELSE
             MOVE "5921"    TO WS-RESPONSE-CODE
             STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
             DELIMITED BY SIZE
             "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
             MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
             MOVE "09"      TO WS-RESPONSE-COUNTER
             PERFORM HATA-VER-WORK
             go to mfys-entegrasyon-exit
           END-IF
       ELSE
           MOVE S-ENT-TUTAR  TO ENT-TUTAR OF D-ENTEG
           MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
           MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
      IF  IOISLEM-TURU OF D-OZET  (1:1) = "8" or
          IOISLEM-TURU OF D-OZET  (1:1) = "3"
           PERFORM KONTROL-KONSINYE
     END-IF
*---------------------------------------------------------------*
*smart kart konsinye urun tablosunda tanimli olmamasina ragmen  *
*diger konsinye urunler gibi dvs'den satisi yapilacagindan      *
*ws-konsinye-flag true olarak set ediliyor ve muhasebe fisi     *
*olusturulmuyor.                                                *
*---------------------------------------------------------------*
          IF ENT-HESAP-REF-NO OF D-ENTEG = "153020000010" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000001" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000015" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000017" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000002" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000004" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000005" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000006" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000013" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000014" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000029" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153020000030" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "326020000004" OR
**altin hesaplari
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000017" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000018" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000019" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000020" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000021" OR
             ENT-HESAP-REF-NO OF D-ENTEG = "153030000022"
**altin hesaplari
             SET WS-KONSINYE-FLAG TO TRUE
          END-IF
           IF WS-KONSINYE-FLAG
              PERFORM INSERT-ENT-KONSINYE
              GO TO MFYS-ENTEGRASYON-EXIT
           ELSE
              PERFORM INSERT-ENTEGRS
           END-IF
           IF OK-MSG = 0 AND OK-MSG-ENT = 0
              PERFORM FIS-ISLEMLERI
           ELSE
              MOVE "5921"    TO WS-RESPONSE-CODE
              STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
              DELIMITED BY SIZE
              "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
              MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
              MOVE "09"      TO WS-RESPONSE-COUNTER
              PERFORM HATA-VER-WORK
              go to mfys-entegrasyon-exit
          END-IF
       END-IF
    END-IF
  END-IF.

 IF S-ENT-TUTAR1 NOT EQUAL 0
    IF MUH-HES-REF-NO1 OF D-ISLEMTUR = SPACE
    if not (islem-turu of d-islemtur = "1210" or
            islem-turu of d-islemtur = "2100" or
            islem-turu of d-islemtur = "5100" or
            islem-turu of d-islemtur = "7100" or
            islem-turu of d-islemtur = "7200")
          DISPLAY " OZET TABLOSUNDAKI TUTAR1 KOLONUNDA DEGER OLDUGU HALDE "
          DISPLAY " ISLEMTUR TABLOSUNDAKI MUH-HES-REF-NO1 KOLONUNDA "
          DISPLAY " HESAP-NO BILGISI YOK. TUTAR KOLONUNDAKI DEGER ICIN "
          DISPLAY " MUHASEBELESTIRME YAPILMIYOR, TIKKAT TIKKAT! "
          DISPLAY " ISLEM TURU : " ISLEM-TURU OF D-ISLEMTUR
    end-if
    ELSE
       IF ISLEM-TURU OF D-ISLEMTUR = "5100" OR
          ISLEM-TURU OF D-ISLEMTUR = "5200" OR
          ISLEM-TURU OF D-ISLEMTUR = "5300"
          MOVE 2 TO CARPAN OF D-ISLEMTUR
       END-IF
       INITIALIZE D-HESPLAN
       MOVE MUH-HES-REF-NO1 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
       IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
          MOVE MUH-HES-REF-NO1 TO GMU-HESAP-REF-NO OF D-HESPLAN
       END-IF
       PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
           if   islem-turu of d-islemtur = "2100"
              move iotutar of d-ozet to ent-doviz-miktari of d-enteg
           else
              MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
           end-if
             MOVE S-ENT-TUTAR1 TO ENT-TUTAR OF D-ENTEG
             MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
               PERFORM INSERT-ENTEGRS
          IF OK-MSG = 0 AND OK-MSG-ENT = 0
             PERFORM FIS-ISLEMLERI
          ELSE
             MOVE "5921"    TO WS-RESPONSE-CODE
             STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
             DELIMITED BY SIZE
             "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
             MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
             MOVE "09"      TO WS-RESPONSE-COUNTER
             PERFORM HATA-VER-WORK
              END-IF
       ELSE
         MOVE S-ENT-TUTAR1 TO ENT-TUTAR OF D-ENTEG
         MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
         MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
         PERFORM INSERT-ENTEGRS
         IF OK-MSG = 0 AND OK-MSG-ENT = 0
            PERFORM FIS-ISLEMLERI
         ELSE
            MOVE "5921"    TO WS-RESPONSE-CODE
            STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
            DELIMITED BY SIZE
            "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
            MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
            MOVE "09"      TO WS-RESPONSE-COUNTER
            PERFORM HATA-VER-WORK
         END-IF
      END-IF
    END-IF
  END-IF.

 IF S-ENT-TUTAR2 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO2 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO2 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
        if   islem-turu of d-islemtur = "2100"
             COMPUTE ent-doviz-miktari of d-enteg ROUNDED = (IOTUTAR2 * 0.28 )
        else
              MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
        end-if
**     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR2 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR2 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

 IF S-ENT-TUTAR3 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO3 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO3 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
       MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
**     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR3 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR3 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

 IF S-ENT-TUTAR4 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO4 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO4 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
       MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
**     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR4 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR4 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

   IF S-ENT-TUTAR5 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO5 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO5 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
       if   islem-turu of d-islemtur = "2100"
               COMPUTE IOTUTAR2 OF D-OZET ROUNDED = (IOTUTAR2 OF D-OZET * (0.72) )
                move iotutar2 of d-ozet to ent-doviz-miktari of d-enteg
       else
       MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       end-if
***     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR5 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR5 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

   IF S-ENT-TUTAR6 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO6 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO6 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
      if  islem-turu of d-islemtur = "1100" or
          islem-turu of d-islemtur = "6200" or
          islem-turu of d-islemtur = "7200"
      move " " to odeme-kodu of d-islemtur
      end-if
     PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
       MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
**     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR6 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR6 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

  IF S-ENT-TUTAR7 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO7 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO7 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")

       MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
**     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR7 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR7 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

  IF S-ENT-TUTAR8 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO8 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO8 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
       MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
**     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR8 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR8 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

  IF S-ENT-TUTAR9 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO9 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO9 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")

       MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
**     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR9 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR9 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

  IF S-ENT-TUTAR10 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO10 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO10 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")

       MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
**     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR10 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR10 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

  IF S-ENT-TUTAR11 NOT EQUAL 0
    INITIALIZE D-HESPLAN
    MOVE MUH-HES-REF-NO11 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
       MOVE MUH-HES-REF-NO11 TO GMU-HESAP-REF-NO OF D-HESPLAN
    END-IF
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
        MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
**     COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
       MOVE S-ENT-TUTAR11 TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-TUTAR11 TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

  IF S-ENT-TUTAR12 NOT EQUAL 0
    IF MUH-HES-REF-NO12 OF D-ISLEMTUR = SPACE
       DISPLAY " OZET TABLOSUNDAKI TUTAR KOLONUNDA DEGER OLDUGU HALDE "
       DISPLAY " ISLEMTUR TABLOSUNDAKI MUH-HES-REF-NO KOLONUNDA "
       DISPLAY " HESAP-NO BILGISI YOK. TUTAR KOLONUNDAKI DEGER ICIN "
       DISPLAY " MUHASEBELESTIRME YAPILMIYOR, TIKKAT TIKKAT! "
       DISPLAY " ISLEM TURU : " ISLEM-TURU OF D-ISLEMTUR
    ELSE

       INITIALIZE D-HESPLAN
       MOVE MUH-HES-REF-NO12 OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
       IF MUH-HES-REF-NO OF D-ISLEMTUR = SPACE
          MOVE MUH-HES-REF-NO12 TO GMU-HESAP-REF-NO OF D-HESPLAN
       END-IF
       PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
          MOVE S-ENT-TUTAR TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
**      COMPUTE S-ENT-TUTAR ROUNDED = S-ENT-TUTAR * ENT-DOVIZ-KURU  OF D-ENTEG
          MOVE S-ENT-TUTAR12 TO ENT-TUTAR OF D-ENTEG
          MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
          PERFORM INSERT-ENTEGRS
          IF OK-MSG = 0 AND OK-MSG-ENT = 0
             PERFORM FIS-ISLEMLERI
          ELSE
             MOVE "5921"    TO WS-RESPONSE-CODE
             STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
             DELIMITED BY SIZE
             "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
             MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
             MOVE "09"      TO WS-RESPONSE-COUNTER
             PERFORM HATA-VER-WORK
          END-IF
       ELSE
          MOVE S-ENT-TUTAR12 TO ENT-TUTAR OF D-ENTEG
          MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
          MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
          PERFORM INSERT-ENTEGRS
          IF OK-MSG = 0 AND OK-MSG-ENT = 0
             PERFORM FIS-ISLEMLERI
          ELSE
             MOVE "5921"    TO WS-RESPONSE-CODE
             STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
             DELIMITED BY SIZE
             "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
             MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
             MOVE "09"      TO WS-RESPONSE-COUNTER
             PERFORM HATA-VER-WORK
          END-IF
       END-IF
   END-IF
  END-IF.

**eger kurumdan alinan komisyon islem aninda dusuluyorsa kesilen
**komisyon da muhasebelesiyor.

  IF WS-KOMISYON-VAR-FLAG AND S-ENT-KOMISYON > 0
    INITIALIZE D-HESPLAN
    MOVE MUH-KOM-HES-REF-NO OF D-ISLEMTUR TO GMU-HESAP-REF-NO OF D-HESPLAN
    PERFORM SELECT-HESAP-PLANI
*       if not  (PARA-TURU OF D-OZET = "YTL" OR
*                  PARA-TURU OF D-OZET = "TRL" OR
*                  PARA-TURU OF D-OZET = "TL " )
         if not (ENT-DOVIZ-CINSI OF D-ENTEG = "TRL" or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "TL " or
                 ENT-DOVIZ-CINSI OF D-ENTEG = "YTL")
       MOVE S-ENT-KOMISYON TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE S-ENT-KOMISYON TO ENT-TUTAR OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    ELSE
       MOVE S-ENT-KOMISYON TO ENT-TUTAR OF D-ENTEG
       MOVE 0 TO ENT-DOVIZ-MIKTARI  OF D-ENTEG
       MOVE GMU-HESAP-REF-NO OF D-HESPLAN TO ENT-HESAP-REF-NO OF D-ENTEG
       PERFORM INSERT-ENTEGRS
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM FIS-ISLEMLERI
       ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING ISLEM-TURU OF D-ISLEMTUR " ENTEGRASYON TABLOSUNA "
          DELIMITED BY SIZE
          "KAYIT EKLENEMEDÝ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "09"      TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
       END-IF
    END-IF
  END-IF.

 MFYS-ENTEGRASYON-EXIT.
      EXIT.
*****************************************************************************
 SELECT-ISLEMTUR SECTION.

  MOVE "=ISLEMTUR" TO WS-HATA-TABLE-NAME

   EXEC SQL
     SELECT ISLEM_ACIKLAMA,MUH_HES_REF_NO,MUH_HES_REF_NO1,
            MUH_HES_REF_NO2,MUH_HES_REF_NO3,MUH_HES_REF_NO4,
            MUH_HES_REF_NO5,MUH_HES_REF_NO6,MUH_HES_REF_NO7,
            MUH_HES_REF_NO8,MUH_HES_REF_NO9,MUH_HES_REF_NO10,
            MUH_HES_REF_NO11,MUH_HES_REF_NO12,
            MUH_KOM_HES_REF_NO,KOMISYON,CARPAN,
            ODEME_KODU,
            ISLEM_ACIKLAMA1,ISLEM_ACIKLAMA2,muh_hesap1
       INTO :ISLEM-ACIKLAMA      OF D-ISLEMTUR,
            :MUH-HES-REF-NO      OF D-ISLEMTUR,
            :MUH-HES-REF-NO1     OF D-ISLEMTUR,
            :MUH-HES-REF-NO2     OF D-ISLEMTUR,
            :MUH-HES-REF-NO3     OF D-ISLEMTUR,
            :MUH-HES-REF-NO4     OF D-ISLEMTUR,
            :MUH-HES-REF-NO5     OF D-ISLEMTUR,
            :MUH-HES-REF-NO6     OF D-ISLEMTUR,
            :MUH-HES-REF-NO7     OF D-ISLEMTUR,
            :MUH-HES-REF-NO8     OF D-ISLEMTUR,
            :MUH-HES-REF-NO9     OF D-ISLEMTUR,
            :MUH-HES-REF-NO10    OF D-ISLEMTUR,
            :MUH-HES-REF-NO11    OF D-ISLEMTUR,
            :MUH-HES-REF-NO12    OF D-ISLEMTUR,
            :MUH-KOM-HES-REF-NO  OF D-ISLEMTUR,
            :KOMISYON            OF D-ISLEMTUR,
            :CARPAN              OF D-ISLEMTUR,
            :ODEME-KODU          OF D-ISLEMTUR,
            :ISLEM-ACIKLAMA1     OF D-ISLEMTUR,
            :ISLEM-ACIKLAMA2     OF D-ISLEMTUR ,
            :muh-hesap1
**dagýtým kodlarý için deðiþtirldi.
          FROM $data18.muhtab.islemtur
**        FROM $DATA20.sezer.ISLEMyd
      WHERE ISLEM_TURU = :ISLEM-TURU OF D-ISLEMTUR  AND
             PARA_TURU = :PARA-TURU  OF D-ISLEMTUR
      BROWSE ACCESS
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
   WHEN 0
     CONTINUE
   WHEN 100
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
     MOVE "10"          TO WS-RESPONSE-COUNTER
     DISPLAY "ISLEM-TURU : " ISLEM-TURU OF D-ISLEMTUR
     DISPLAY "PARA-TURU : " PARA-TURU OF D-ISLEMTUR
     PERFORM HATA-VER-WORK
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "11"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
    END-EVALUATE.

 SELECT-ISLEMTUR-EXIT.
        EXIT.
******************************************************************************
 SELECT-BOLGE-KODU SECTION.

 MOVE "=PTTMRK" TO WS-HATA-TABLE-NAME
 MOVE IOMERKEZ-NO TO MERKEZ-NO OF D-PTTMRK

  EXEC SQL
    SELECT DISTINCT(BOLGE_KODU)
      INTO :BOLGE-KODU OF D-PTTMRK
      FROM =PTTMRK
      WHERE MERKEZ_NO = :MERKEZ-NO OF D-PTTMRK
    BROWSE ACCESS
  END-EXEC.
  EVALUATE SQLCODE OF SQLCA
   WHEN 0
     CONTINUE
   WHEN 100
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
     MOVE "12"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "13"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   END-EVALUATE.

 SELECT-BOLGE-KODU-EXIT.
       EXIT.
******************************************************************************
 KONTROL-KONSINYE SECTION.

 MOVE "=KRMURUN"  TO WS-HATA-TABLE-NAME
 MOVE ENT-HESAP-REF-NO OF D-ENTEG TO MUH-HES-REF-NO OF D-ISLEMTUR

  EXEC SQL
    SELECT COUNT (*)
      INTO :S-KONSINYE-KURUM-ADET
      FROM =KRMURUN
      WHERE CAST (KURUM_KODU AS CHAR(03)) IN (
      SELECT SUBSTRING (ISLEM_TURU FROM 2 FOR 3) FROM
      $data18.muhtab.islemtur
*      $data20.sezer.islemyd
      WHERE MUH_HES_REF_NO = :MUH-HES-REF-NO OF D-ISLEMTUR
      BROWSE ACCESS)   AND
      KURUM_KODU NOT IN (286,667,951,536,718,719 )
    BROWSE ACCESS
  END-EXEC.
  EVALUATE SQLCODE OF SQLCA
   WHEN 0
     IF S-KONSINYE-KURUM-ADET > 0
        SET WS-KONSINYE-FLAG TO TRUE
     END-IF
   WHEN 100
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
     MOVE "12"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "13"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   END-EVALUATE.

 KONTROL-KONSINYE-EXIT.
     EXIT.
*******************************************************************************
 SELECT-HESAP-PLANI SECTION.

  MOVE "=HESPLANI"     TO WS-HATA-TABLE-NAME
  MOVE WS-KURULUS-KODU TO GMU-KURULUS-KODU OF D-HESPLAN
  INITIALIZE WS-flag13
  EXEC SQL
    SELECT GMU_HESAP_ADI,GMU_ODEME_KODU,GMU_HESAP_OZELLIGI
      INTO :GMU-HESAP-ADI  OF D-HESPLAN,
           :GMU-ODEME-KODU OF D-HESPLAN,
           :GMU-HESAP-OZELLIGI OF D-HESPLAN
     FROM =HESPLANI
     WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-HESPLAN AND
           GMU_HESAP_REF_NO = :GMU-HESAP-REF-NO OF D-HESPLAN
     BROWSE ACCESS
  END-EXEC.
  EVALUATE SQLCODE OF SQLCA
   WHEN 0
     MOVE GMU-HESAP-ADI OF D-HESPLAN  TO ENT-HESAP-ADI   OF D-ENTEG
**   MOVE GMU-ODEME-KODU OF D-HESPLAN TO ENT-DOVIZ-CINSI OF D-ENTEG
     if odeme-kodu of d-islemtur not equal " "
        move  ODEME-KODU OF D-islemtur TO ENT-DOVIZ-CINSI OF D-ENTEG
     else
        MOVE GMU-ODEME-KODU OF D-HESPLAN TO ENT-DOVIZ-CINSI OF D-ENTEG
     end-if
*dvz     IF NOT (GMU-ODEME-KODU OF D-HESPLAN = "TRL" OR
*dvz             GMU-ODEME-KODU OF D-HESPLAN = "TL " OR
*dvz             GMU-ODEME-KODU OF D-HESPLAN = "YTL")

*dvz        MOVE ODEME-KODU OF D-ISLEMTUR    TO ENT-DOVIZ-CINSI OF D-ENTEG
*dvz     ELSE
*dvz        MOVE GMU-ODEME-KODU OF D-HESPLAN TO ENT-DOVIZ-CINSI OF D-ENTEG
*dvz     END-IF
    IF GMU-HESAP-OZELLIGI OF D-HESPLAN = "B"
    SET WS-BSMV-FLAG  TO TRUE
    END-IF

   WHEN 100
     display "-------------------------------------"
     display " islem-turu : " islem-turu of d-islemtur
     display "-------------------------------------"
     DISPLAY " HESAP-REF-NO : " GMU-HESAP-REF-NO OF D-HESPLAN
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
     MOVE "14"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "15"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   END-EVALUATE.

 SELECT-HESAP-PLANI-EXIT.
     EXIT.
******************************************************************************
 INSERT-ENTEGRS SECTION.

  MOVE "=ENTEGRS" TO WS-HATA-TABLE-NAME

    IF IOISLEM-TURU OF D-OZET > "8000"
       IF CARPAN OF D-ISLEMTUR = 2
          MOVE 3 TO ENT-ISLEM-TIPI OF D-ENTEG
       ELSE
          IF CARPAN OF D-ISLEMTUR = 0
             MOVE 4 TO ENT-ISLEM-TIPI OF D-ENTEG
          END-IF
       END-IF
    ELSE
       IF CARPAN OF D-ISLEMTUR = 2
          MOVE 1 TO ENT-ISLEM-TIPI OF D-ENTEG
       ELSE
          IF CARPAN OF D-ISLEMTUR = 0
             MOVE 2 TO ENT-ISLEM-TIPI OF D-ENTEG
          END-IF
       END-IF
    END-IF

*  IF NOT (GMU-ODEME-KODU OF D-HESPLAN = "TRL" OR
*          GMU-ODEME-KODU OF D-HESPLAN = "TL " OR
*          GMU-ODEME-KODU OF D-HESPLAN = "YTL")
   if not  (PARA-TURU OF D-OZET = "YTL" OR
            PARA-TURU OF D-OZET = "TRL" OR
            PARA-TURU OF D-OZET = "TL " )
      MOVE PARA-KURU OF D-OZET TO ENT-DOVIZ-KURU  OF D-ENTEG
  ELSE
     MOVE 1 TO ENT-DOVIZ-KURU OF D-ENTEG
  END-IF.

  IF S-ONCEKI-MERKEZ-NO = ENT-MERKEZ-NO OF D-ENTEG AND
       S-ONCEKI-SUBE-NO = ENT-SUBE-NO   OF D-ENTEG AND
       S-ONCEKI-GISE-NO = ENT-GISE-NO   OF D-ENTEG
       ADD 1 TO S-SIRA-NO
  ELSE
       MOVE 1 TO S-SIRA-NO
  END-IF.

  MOVE S-SIRA-NO TO ENT-SIRA-NO OF D-ENTEG

  IF ENT-HESAP-REF-NO OF D-ENTEG = "106030000014" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000016" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000025" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000026" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000028" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000030"
     IF ENT-ISLEM-TIPI OF D-ENTEG = 1
        MOVE 2 TO ENT-ISLEM-TIPI OF D-ENTEG
     ELSE
        IF ENT-ISLEM-TIPI OF D-ENTEG = 3
           MOVE 4 TO ENT-ISLEM-TIPI OF D-ENTEG
        ELSE
           IF ENT-ISLEM-TIPI OF D-ENTEG = 2
              MOVE 1 TO ENT-ISLEM-TIPI OF D-ENTEG
           ELSE
              IF ENT-ISLEM-TIPI OF D-ENTEG = 4
                 MOVE 3 TO ENT-ISLEM-TIPI OF D-ENTEG
              END-IF
           END-IF
        END-IF
     END-IF
  END-IF.


   EXEC SQL
     INSERT INTO $DATA18.MUHTAB.ENTEGRS VALUES(
       :ENT-SIRA-NO        OF D-ENTEG,
       :ENT-ISLEM-YIL      OF D-ENTEG,
       :ENT-ISLEM-AY       OF D-ENTEG,
       :ENT-ISLEM-GUN      OF D-ENTEG,
       :ENT-BOLGE-KODU     OF D-ENTEG,
       :ENT-MERKEZ-NO      OF D-ENTEG,
       :ENT-SUBE-NO        OF D-ENTEG,
       :ENT-GISE-NO        OF D-ENTEG,
       :ENT-HESAP-REF-NO   OF D-ENTEG,
       :ENT-HESAP-ADI      OF D-ENTEG,
       :ENT-TUTAR          OF D-ENTEG,
       :ENT-ISLEM-TIPI     OF D-ENTEG,
       :ENT-ISLEM-ADET     OF D-ENTEG,
       :ENT-DOVIZ-CINSI    OF D-ENTEG,
       :ENT-DOVIZ-MIKTARI  OF D-ENTEG,
       :ENT-DOVIZ-KURU     OF D-ENTEG,
       :ENT-SISTEM-YIL     OF D-ENTEG,
       :ENT-SISTEM-AY      OF D-ENTEG,
       :ENT-SISTEM-GUN     OF D-ENTEG,
       :ENT-SISTEM-SAAT    OF D-ENTEG)
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
   WHEN 0
     CONTINUE
   WHEN -8227
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "DUPLICATE"   TO WS-HATA-MESAJI-TIPI
     MOVE "16"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   WHEN -8405
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NONNUMERIC"  TO WS-HATA-MESAJI-TIPI
     MOVE "17"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     DISPLAY "SQLCODE :" SQLCODE OF SQLCA
     MOVE "18"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
  END-EVALUATE.

  MOVE IOMERKEZ-NO OF D-OZET TO S-ONCEKI-MERKEZ-NO
  MOVE IOSUBE-NO   OF D-OZET TO S-ONCEKI-SUBE-NO
  MOVE IOGISE-NO   OF D-OZET TO S-ONCEKI-GISE-NO.

 INSERT-ENTEGRS-EXIT.
     EXIT.
******************************************************************************
 INSERT-ENT-KONSINYE SECTION.

  MOVE "=ENTKONSY" TO WS-HATA-TABLE-NAME

    IF IOISLEM-TURU OF D-OZET > "8000"
       IF CARPAN OF D-ISLEMTUR = 2
          MOVE 3 TO ENT-ISLEM-TIPI OF D-ENTEG
       ELSE
          IF CARPAN OF D-ISLEMTUR = 0
             MOVE 4 TO ENT-ISLEM-TIPI OF D-ENTEG
          END-IF
       END-IF
    ELSE
       IF CARPAN OF D-ISLEMTUR = 2
          MOVE 1 TO ENT-ISLEM-TIPI OF D-ENTEG
       ELSE
          IF CARPAN OF D-ISLEMTUR = 0
             MOVE 2 TO ENT-ISLEM-TIPI OF D-ENTEG
          END-IF
       END-IF
    END-IF

  IF NOT (GMU-ODEME-KODU OF D-HESPLAN = "TRL" OR
          GMU-ODEME-KODU OF D-HESPLAN = "TL " OR
          GMU-ODEME-KODU OF D-HESPLAN = "YTL")
     MOVE PARA-KURU OF D-OZET TO ENT-DOVIZ-KURU  OF D-ENTEG
  ELSE
     MOVE 1 TO ENT-DOVIZ-KURU OF D-ENTEG
  END-IF.

  IF S-ONCEKI-MERKEZ-NO = ENT-MERKEZ-NO OF D-ENTEG AND
       S-ONCEKI-SUBE-NO = ENT-SUBE-NO   OF D-ENTEG AND
       S-ONCEKI-GISE-NO = ENT-GISE-NO   OF D-ENTEG
       ADD 1 TO S-SIRA-NO
  ELSE
       MOVE 1 TO S-SIRA-NO
  END-IF.

  MOVE S-SIRA-NO TO ENT-SIRA-NO OF D-ENTEG

  IF ENT-HESAP-REF-NO OF D-ENTEG = "106030000014" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000016" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000025" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000026" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000028" OR
     ENT-HESAP-REF-NO OF D-ENTEG = "106030000030"
     IF ENT-ISLEM-TIPI OF D-ENTEG = 1
        MOVE 2 TO ENT-ISLEM-TIPI OF D-ENTEG
     ELSE
        IF ENT-ISLEM-TIPI OF D-ENTEG = 3
           MOVE 4 TO ENT-ISLEM-TIPI OF D-ENTEG
        ELSE
           IF ENT-ISLEM-TIPI OF D-ENTEG = 2
              MOVE 1 TO ENT-ISLEM-TIPI OF D-ENTEG
           ELSE
              IF ENT-ISLEM-TIPI OF D-ENTEG = 4
                 MOVE 3 TO ENT-ISLEM-TIPI OF D-ENTEG
              END-IF
           END-IF
        END-IF
     END-IF
  END-IF.


   EXEC SQL
     INSERT INTO $DATA18.muhtab.ENTKONSY VALUES(
       :ENT-SIRA-NO        OF D-ENTEG,
       :ENT-ISLEM-YIL      OF D-ENTEG,
       :ENT-ISLEM-AY       OF D-ENTEG,
       :ENT-ISLEM-GUN      OF D-ENTEG,
       :ENT-BOLGE-KODU     OF D-ENTEG,
       :ENT-MERKEZ-NO      OF D-ENTEG,
       :ENT-SUBE-NO        OF D-ENTEG,
       :ENT-GISE-NO        OF D-ENTEG,
       :ENT-HESAP-REF-NO   OF D-ENTEG,
       :ENT-HESAP-ADI      OF D-ENTEG,
       :ENT-TUTAR          OF D-ENTEG,
       :ENT-ISLEM-TIPI     OF D-ENTEG,
       :ENT-ISLEM-ADET     OF D-ENTEG,
       :ENT-DOVIZ-CINSI    OF D-ENTEG,
       :ENT-DOVIZ-MIKTARI  OF D-ENTEG,
       :ENT-DOVIZ-KURU     OF D-ENTEG,
       :ENT-SISTEM-YIL     OF D-ENTEG,
       :ENT-SISTEM-AY      OF D-ENTEG,
       :ENT-SISTEM-GUN     OF D-ENTEG,
       :ENT-SISTEM-SAAT    OF D-ENTEG)
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
   WHEN 0
     CONTINUE
   WHEN -8227
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "DUPLICATE"   TO WS-HATA-MESAJI-TIPI
     MOVE "16"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   WHEN -8405
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NONNUMERIC"  TO WS-HATA-MESAJI-TIPI
     MOVE "17"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "18"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
  END-EVALUATE.

  MOVE IOMERKEZ-NO OF D-OZET TO S-ONCEKI-MERKEZ-NO
  MOVE IOSUBE-NO   OF D-OZET TO S-ONCEKI-SUBE-NO
  MOVE IOGISE-NO   OF D-OZET TO S-ONCEKI-GISE-NO.

 INSERT-ENTEGRS-EXIT.
     EXIT.
******************************************************************************
 FIS-ISLEMLERI SECTION.

  IF NOT (ENT-DOVIZ-CINSI OF D-ENTEG = "YTL" OR
          ENT-DOVIZ-CINSI OF D-ENTEG = "TL " OR
          ENT-DOVIZ-CINSI OF D-ENTEG = "TRL")
     SET WS-DOVIZ-FLAG TO TRUE
  ELSE
     move "100020000001" to s-kasa-hesap
     INITIALIZE WS-FLAG8
  END-IF.

*******************
*1-TAHSILAT       *
*2-TEDIYE         *
*3-ATM TAHSILAT   *
*4-ATM TEDIYE     *
*******************

  IF ENT-ISLEM-TIPI OF D-ENTEG = 1 OR ENT-ISLEM-TIPI OF D-ENTEG = 3

   if ws-bsmv-flag
        perform fis-tahsilat-bsmv-NAKIT
          if ok-msg = 0
             perform fis-mahsup-bsmv
          end-if
   ELSE
         PERFORM FIS-TAHSILAT-NAKIT
   END-IF

  END-IF.

***tediye de bsmv iþlemi yok
  IF ENT-ISLEM-TIPI OF D-ENTEG = 2 OR ENT-ISLEM-TIPI OF D-ENTEG = 4
     IF WS-DOVIZ-FLAG
        PERFORM FIS-TEDIYE-DOVIZ
     ELSE
        PERFORM FIS-TEDIYE-NAKIT
     END-IF
  END-IF.


 FIS-ISLEMLERI-EXIT.
      EXIT.
*******************************************************************************
  FIS-TAHSILAT-BSMV-NAKIT SECTION.

     IF ENT-ISLEM-TIPI OF D-ENTEG = 1
      if ws-doviz-flag
        move "130"                         to ws-fis-turu
         MOVE s-kasa-hesap                  TO WS-HESAP-REF-NO

      else
        MOVE "110"                         TO WS-FIS-TURU
         MOVE s-kasa-hesap                  TO WS-HESAP-REF-NO
      end-if
     ELSE
        IF ENT-ISLEM-TIPI OF D-ENTEG = 3
           MOVE "113"               TO WS-FIS-TURU
           MOVE S-ATM-TAHSIL-HESAP  TO WS-HESAP-REF-NO
           MOVE WS-ATM-FIS-ACIKLAMA TO WS-FIS-ACIKLAMA
        END-IF
     END-IF.

   PERFORM C-SIRA-NO-AL
   IF OK-MSG = 0 AND OK-MSG-ENT = 0
      PERFORM D-FIS-BASLIK
   END-IF.

 INITIALIZE WS-TOPLAM-BORC-TUTAR,  WS-TOPLAM-ALACAK-TUTAR

*once parametre tablosundan select edilen hesap icin fisdetay ve ozethes
*tablolarina kayit insert/update ediliyor.

     MOVE ENT-TUTAR          OF D-ENTEG TO WS-BORC-TUTAR
     MOVE 0                             TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
*??     IF OK-MSG = 0 AND OK-MSG-ENT = 0
*??        PERFORM E20-KDV-KONTROL
*??    END-IF
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

*simdi entegrasyon tablosundaki hesap icin fisdetay ve ozethes tablolarina
*kayit insert/update ediliyor.

     MOVE ENT-HESAP-REF-NO   OF D-ENTEG TO WS-HESAP-REF-NO
     MOVE 0                             TO WS-BORC-TUTAR
     MOVE ENT-TUTAR          OF D-ENTEG TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

*??    PERFORM E10-HESPLANI-KONTROL
*??     IF OK-MSG = 0 AND OK-MSG-ENT = 0
*??        PERFORM E20-KDV-KONTROL
*??     END-IF
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM E30-FIS-ISLEMLERI-DEVAM
      END-IF.

*simdi de eger entegrasyonu yapilan hesap kdv'li bir hesapsa
*kdv tutari icin bir kayit olusturuluyor.

*??  IF WS-KDV-VAR-FLAG AND WS-KDV-TUTAR > 0

*??     MOVE GMU-KDV-HESAP-REF-NO OF D-HESPLAN TO WS-HESAP-REF-NO
*??     MOVE 0                                 TO WS-BORC-TUTAR
*??     MOVE WS-KDV-TUTAR                      TO WS-ALACAK-TUTAR
*??     MOVE ENT-DOVIZ-MIKTARI    OF D-ENTEG   TO WS-DOVIZ-MIKTAR
*??     MOVE ENT-DOVIZ-KURU       OF D-ENTEG   TO WS-DOVIZ-KURU
*??
*??     INITIALIZE D-HESPLAN, WS-DGT-KODU
*??
*??     PERFORM E10-HESPLANI-KONTROL
*??     IF OK-MSG = 0 AND OK-MSG-ENT = 0
*??        PERFORM E30-FIS-ISLEMLERI-DEVAM
*??     END-IF
*??   END-IF.
   IF WS-TOPLAM-BORC-TUTAR NOT EQUAL WS-TOPLAM-ALACAK-TUTAR
      DISPLAY "FÝÞÝN TOPLAM BORÇ TUTARI VE TOPLAM ALACAK TUTARI EÞÝT OLMALI!"
      PERFORM HATA-VER-WORK
   END-IF.

 FIS-TAHSILAT-BSMV-NAKIT-EXIT.
      EXIT.


********************************************************************************
 FIS-MAHSUP-BSMV SECTION.


        MOVE "330"                         TO WS-FIS-TURU
*        MOVE "740040000850"                TO WS-HESAP-REF-NO
        MOVE S-BSMV-HESAP-740              TO WS-HESAP-REF-NO
        MOVE WS-GISE-FIS-ACIKLAMA          TO WS-FIS-ACIKLAMA
    COMPUTE ENT-TUTAR OF D-ENTEG  rounded =  ENT-TUTAR OF D-ENTEG * 0.05

    if ent-tutar of d-enteg > 0

       PERFORM C-SIRA-NO-AL
        IF OK-MSG = 0 AND OK-MSG-ENT = 0
         PERFORM D-FIS-BASLIK
       END-IF
   else
   go to FIS-MAHSUP-BSMV-EXIT
   end-if.

 INITIALIZE WS-TOPLAM-BORC-TUTAR,  WS-TOPLAM-ALACAK-TUTAR

*once parametre tablosundan select edilen hesap icin fisdetay ve ozethes
*tablolarina kayit insert/update ediliyor.

     MOVE ENT-TUTAR          OF D-ENTEG TO WS-BORC-TUTAR
     MOVE 0                             TO WS-ALACAK-TUTAR
     MOVE 0                             TO WS-DOVIZ-MIKTAR
     MOVE 0                             TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
*??     IF OK-MSG = 0 AND OK-MSG-ENT = 0
*??        PERFORM E20-KDV-KONTROL
*??     END-IF
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

*simdi entegrasyon tablosundaki hesap icin fisdetay ve ozethes tablolarina
*kayit insert/update ediliyor.

*     MOVE "360030000003"                TO WS-HESAP-REF-NO
     MOVE S-BSMV-HESAP-360              TO WS-HESAP-REF-NO
     MOVE 0                             TO WS-BORC-TUTAR
     MOVE ENT-TUTAR          OF D-ENTEG TO WS-ALACAK-TUTAR
     MOVE 0                             TO WS-DOVIZ-MIKTAR
     MOVE 0                             TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

      PERFORM E10-HESPLANI-KONTROL
*??     IF OK-MSG = 0 AND OK-MSG-ENT = 0
*??        PERFORM E20-KDV-KONTROL
*??     END-IF
       IF OK-MSG = 0 AND OK-MSG-ENT = 0
          PERFORM E30-FIS-ISLEMLERI-DEVAM
       END-IF.

*simdi de eger entegrasyonu yapilan hesap kdv'li bir hesapsa
*kdv tutari icin bir kayit olusturuluyor.

*??  IF WS-KDV-VAR-FLAG AND WS-KDV-TUTAR > 0

*??     MOVE GMU-KDV-HESAP-REF-NO OF D-HESPLAN TO WS-HESAP-REF-NO
*??     MOVE 0                                 TO WS-BORC-TUTAR
*??     MOVE WS-KDV-TUTAR                      TO WS-ALACAK-TUTAR
*??     MOVE ENT-DOVIZ-MIKTARI    OF D-ENTEG   TO WS-DOVIZ-MIKTAR
*??     MOVE ENT-DOVIZ-KURU       OF D-ENTEG   TO WS-DOVIZ-KURU
*??
*??     INITIALIZE D-HESPLAN, WS-DGT-KODU
*??
*??     PERFORM E10-HESPLANI-KONTROL
*??     IF OK-MSG = 0 AND OK-MSG-ENT = 0
*??        PERFORM E30-FIS-ISLEMLERI-DEVAM
*??     END-IF
*??   END-IF.
   IF WS-TOPLAM-BORC-TUTAR NOT EQUAL WS-TOPLAM-ALACAK-TUTAR
      DISPLAY "FÝÞÝN TOPLAM BORÇ TUTARI VE TOPLAM ALACAK TUTARI EÞÝT OLMALI!"
      PERFORM HATA-VER-WORK
   END-IF.

 FIS-MAHSUP-BSMV-EXIT.
      EXIT.



*******************************************************************************

  FIS-TAHSILAT-NAKIT SECTION.

     IF ENT-ISLEM-TIPI OF D-ENTEG = 1
      if ws-doviz-flag
         if  islem-turu of d-islemtur = "5100"  or
             islem-turu of d-islemtur = "5200"  or
             islem-turu of d-islemtur = "5300"
         move "133"    to ws-fis-turu
         else
         move "130"                         to ws-fis-turu
*        MOVE GMU-DOVIZ-KASA-REF OF D-PARAM TO WS-HESAP-REF-NO
         end-if
     else
        MOVE "110"                         TO WS-FIS-TURU
*        MOVE GMU-NAKIT-KASA-REF OF D-PARAM TO WS-HESAP-REF-NO
      end-if
         move s-kasa-hesap                  to ws-hesap-ref-no
     ELSE
        IF ENT-ISLEM-TIPI OF D-ENTEG = 3
           MOVE "113"               TO WS-FIS-TURU
           MOVE S-ATM-TAHSIL-HESAP  TO WS-HESAP-REF-NO
           MOVE WS-ATM-FIS-ACIKLAMA TO WS-FIS-ACIKLAMA
        END-IF
     END-IF.

   PERFORM C-SIRA-NO-AL
   IF OK-MSG = 0 AND OK-MSG-ENT = 0
      PERFORM D-FIS-BASLIK
   END-IF.

 INITIALIZE WS-TOPLAM-BORC-TUTAR,  WS-TOPLAM-ALACAK-TUTAR

*once parametre tablosundan select edilen hesap icin fisdetay ve ozethes
*tablolarina kayit insert/update ediliyor.

     MOVE ENT-TUTAR          OF D-ENTEG TO WS-BORC-TUTAR
     MOVE 0                             TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E20-KDV-KONTROL
     END-IF
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

*simdi entegrasyon tablosundaki hesap icin fisdetay ve ozethes tablolarina
*kayit insert/update ediliyor.

     MOVE ENT-HESAP-REF-NO   OF D-ENTEG TO WS-HESAP-REF-NO
     MOVE 0                             TO WS-BORC-TUTAR
     MOVE ENT-TUTAR          OF D-ENTEG TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E20-KDV-KONTROL
     END-IF
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

*simdi de eger entegrasyonu yapilan hesap kdv'li bir hesapsa
*kdv tutari icin bir kayit olusturuluyor.

  IF WS-KDV-VAR-FLAG AND WS-KDV-TUTAR > 0

     MOVE GMU-KDV-HESAP-REF-NO OF D-HESPLAN TO WS-HESAP-REF-NO
     MOVE 0                                 TO WS-BORC-TUTAR
     MOVE WS-KDV-TUTAR                      TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI    OF D-ENTEG   TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU       OF D-ENTEG   TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF
   END-IF.
   IF WS-TOPLAM-BORC-TUTAR NOT EQUAL WS-TOPLAM-ALACAK-TUTAR
      DISPLAY "FÝÞÝN TOPLAM BORÇ TUTARI VE TOPLAM ALACAK TUTARI EÞÝT OLMALI!"
      PERFORM HATA-VER-WORK
   END-IF.

 FIS-TAHSILAT-NAKIT-EXIT.
      EXIT.
*******************************************************************************
 FIS-TAHSILAT-DOVIZ SECTION.

   MOVE "130" TO WS-FIS-TURU
   PERFORM C-SIRA-NO-AL
   IF OK-MSG = 0 AND OK-MSG-ENT = 0
      PERFORM D-FIS-BASLIK
   END-IF.

 INITIALIZE WS-TOPLAM-BORC-TUTAR,  WS-TOPLAM-ALACAK-TUTAR

*once parametre tablosundan select edilen hesap icin fisdetay ve ozethes
*tablolarina kayit insert/update ediliyor.

*     MOVE GMU-DOVIZ-KASA-REF OF D-PARAM TO WS-HESAP-REF-NO
     move s-kasa-hesap                  to ws-hesap-ref-no
     MOVE WS-GISE-FIS-ACIKLAMA          TO WS-FIS-ACIKLAMA
     MOVE ENT-TUTAR          OF D-ENTEG TO WS-BORC-TUTAR
     MOVE 0                             TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

*simdi entegrasyon tablosundaki hesap icin fisdetay ve ozethes tablolarina
*kayit insert/update ediliyor.
     MOVE ENT-HESAP-REF-NO   OF D-ENTEG TO WS-HESAP-REF-NO
     MOVE WS-GISE-FIS-ACIKLAMA          TO WS-FIS-ACIKLAMA
     MOVE 0                             TO WS-BORC-TUTAR
     MOVE ENT-TUTAR          OF D-ENTEG TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

     IF WS-TOPLAM-BORC-TUTAR NOT EQUAL WS-TOPLAM-ALACAK-TUTAR
        DISPLAY "FÝÞÝN TOPLAM BORÇ TUTARI VE TOPLAM ALACAK TUTARI EÞÝT OLMALI!"
        PERFORM HATA-VER-WORK
     END-IF.

*doviz islemlerde doviz nazimlarinin da hareket gormesi icin ayrica bir
*mahsup fisi kesiliyor.

*    PERFORM MAHSUP-FISI-DVZ-TAHSIL.

 FIS-TAHSILAT-DOVIZ-EXIT.
      EXIT.
*******************************************************************************
 MAHSUP-FISI-DVZ-TAHSIL SECTION.

  MOVE "$DATA18.MUHTAB.ODEMEKOD"                TO WS-HATA-TABLE-NAME
  MOVE WS-KURULUS-KODU            TO GMU-KURULUS-KODU OF D-ODEKOD
  MOVE ENT-DOVIZ-CINSI OF D-ENTEG TO GMU-ODEME-KODU   OF D-ODEKOD

   EXEC SQL
   SELECT GMU_KARSI_HESAP_EFEKTIF_REF_NO,
          GMU_HESAP_EFEKTIF1_REF_NO,
          GMU_HESAP_EFEKTIF2_REF_NO
          INTO :s-kasa-hesap  ,
               :GMU-HESAP-EFEKTIF1-REF-NO OF D-ODEKOD,
               :GMU-HESAP-EFEKTIF2-REF-NO OF D-ODEKOD
      FROM $DATA18.MUHTAB.ODEMEKOD
      WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-ODEKOD AND
              GMU_ODEME_KODU = :GMU-ODEME-KODU   OF D-ODEKOD
      BROWSE ACCESS
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
   WHEN 0
     MOVE GMU-HESAP-ADI OF D-HESPLAN  TO ENT-HESAP-ADI   OF D-ENTEG
**   MOVE GMU-ODEME-KODU OF D-HESPLAN TO ENT-DOVIZ-CINSI OF D-ENTEG
*****sezer*******************
**hesplanda bir ”nceki tl hesab kaldg i‡in odemekodu TRL kaliyor
**bu yzden odemekod daki odemekodunu set ediyoruz.
*     IF NOT (GMU-ODEME-KODU OF D-HESPLAN = "TRL" OR
*             GMU-ODEME-KODU OF D-HESPLAN = "TL " OR
*             GMU-ODEME-KODU OF D-HESPLAN = "YTL")
*        MOVE ODEME-KODU OF D-ISLEMTUR    TO ENT-DOVIZ-CINSI OF D-ENTEG
*     ELSE
*        MOVE GMU-ODEME-KODU OF D-HESPLAN TO ENT-DOVIZ-CINSI OF D-ENTEG
*     END-IF
   WHEN 100
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
     MOVE "19"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
     GO TO MAHSUP-FISI-DVZ-TAHSIL-EXIT
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "20"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
     GO TO MAHSUP-FISI-DVZ-TAHSIL-EXIT
   END-EVALUATE.

 MOVE "330" TO WS-FIS-TURU
 PERFORM C-SIRA-NO-AL
   IF OK-MSG = 0 AND OK-MSG-ENT = 0
      PERFORM D-FIS-BASLIK
   END-IF.

 INITIALIZE WS-TOPLAM-BORC-TUTAR,  WS-TOPLAM-ALACAK-TUTAR

*once odemekod tablosundan select edilen doviz depo hesabi icin
*fisdetay ve ozethes tablolarina kayit insert/update ediliyor.

*    MOVE GMU-HESAP-DOVIZ2-REF-NO OF D-ODEKOD TO WS-HESAP-REF-NO
     MOVE GMU-HESAP-EFEKTIF1-REF-NO OF D-ODEKOD TO WS-HESAP-REF-NO
     MOVE WS-GISE-FIS-ACIKLAMA                TO WS-FIS-ACIKLAMA
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG       TO WS-BORC-TUTAR
     MOVE 0                                   TO WS-ALACAK-TUTAR

     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

*simdi eodemekod tablosundan select edilen doviz mudi hesabi icin
*fisdetay ve ozethes tablolarina kayit insert/update ediliyor.

*    MOVE GMU-HESAP-DOVIZ1-REF-NO OF D-ODEKOD TO WS-HESAP-REF-NO
     MOVE GMU-HESAP-EFEKTIF2-REF-NO OF D-ODEKOD TO WS-HESAP-REF-NO
     MOVE 0                                   TO WS-BORC-TUTAR
     MOVE ENT-DOVIZ-MIKTARI                   TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI       OF D-ENTEG  TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU          OF D-ENTEG  TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

     IF WS-TOPLAM-BORC-TUTAR NOT EQUAL WS-TOPLAM-ALACAK-TUTAR
        DISPLAY "FÝÞÝN TOPLAM BORÇ TUTARI VE TOPLAM ALACAK TUTARI EÞÝT OLMALI!"
        PERFORM HATA-VER-WORK
     END-IF.


 MAHSUP-FISI-DVZ-TAHSIL-EXIT.
       EXIT.
**********************************************************************************
   FIS-TEDIYE-NAKIT SECTION.

     IF ENT-ISLEM-TIPI OF D-ENTEG = 2
        MOVE "220"                         TO WS-FIS-TURU
*        MOVE GMU-NAKIT-KASA-REF OF D-PARAM TO WS-HESAP-REF-NO
        move s-kasa-hesap                  to ws-hesap-ref-no
        MOVE WS-GISE-FIS-ACIKLAMA          TO WS-FIS-ACIKLAMA
     ELSE
        IF ENT-ISLEM-TIPI OF D-ENTEG = 4
           MOVE "223"               TO WS-FIS-TURU
           MOVE S-ATM-TEDIYE-HESAP  TO WS-HESAP-REF-NO
           MOVE WS-ATM-FIS-ACIKLAMA TO WS-FIS-ACIKLAMA
        END-IF
     END-IF.

   PERFORM C-SIRA-NO-AL
   IF OK-MSG = 0 AND OK-MSG-ENT = 0
      PERFORM D-FIS-BASLIK
   END-IF.

 INITIALIZE WS-TOPLAM-BORC-TUTAR,  WS-TOPLAM-ALACAK-TUTAR

*once entegrasyon tablosundaki hesap icin fisdetay ve ozethes tablolarina
*kayit insert/update ediliyor.

     MOVE ENT-HESAP-REF-NO   OF D-ENTEG TO WS-HESAP-REF-NO
     MOVE ENT-TUTAR          OF D-ENTEG TO WS-BORC-TUTAR
     MOVE 0                             TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E20-KDV-KONTROL
     END-IF

     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

*simdi de eger entegrasyonu yapilan hesap kdv'li bir hesapsa
*kdv tutari icin bir kayit olusturuluyor.

  IF WS-KDV-VAR-FLAG AND WS-KDV-TUTAR > 0

     MOVE GMU-KDV-HESAP-REF-NO OF D-HESPLAN TO WS-HESAP-REF-NO
     MOVE WS-KDV-TUTAR                      TO WS-BORC-TUTAR
     MOVE 0                                 TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI    OF D-ENTEG   TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU       OF D-ENTEG   TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF
   END-IF.

*simdi de parametre tablosundan select edilen hesap icin fisdetay ve ozethes
*tablolarina kayit insert/update ediliyor.

   IF ENT-ISLEM-TIPI OF D-ENTEG = 2
*      MOVE GMU-NAKIT-KASA-REF OF D-PARAM TO WS-HESAP-REF-NO
       move s-kasa-hesap       to ws-hesap-ref-no
   ELSE
      IF ENT-ISLEM-TIPI OF D-ENTEG = 4
         MOVE S-ATM-TEDIYE-HESAP  TO WS-HESAP-REF-NO
      END-IF
   END-IF.

   MOVE 0                             TO WS-BORC-TUTAR
   MOVE ENT-TUTAR          OF D-ENTEG TO WS-ALACAK-TUTAR
   MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
   MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

   INITIALIZE D-HESPLAN, WS-DGT-KODU

   PERFORM E10-HESPLANI-KONTROL
   IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E20-KDV-KONTROL
     END-IF

   IF OK-MSG = 0 AND OK-MSG-ENT = 0
      PERFORM E30-FIS-ISLEMLERI-DEVAM
   END-IF.

   IF WS-TOPLAM-BORC-TUTAR NOT EQUAL WS-TOPLAM-ALACAK-TUTAR
      DISPLAY "FÝÞÝN TOPLAM BORÇ TUTARI VE TOPLAM ALACAK TUTARI EÞÝT OLMALI!"
      PERFORM HATA-VER-WORK
   END-IF.

 FIS-TEDIYE-NAKIT-EXIT.
      EXIT.
*******************************************************************************
 FIS-TEDIYE-DOVIZ SECTION.

    if   islem-turu of d-islemtur = "5100"  or
         islem-turu of d-islemtur = "5200"  or
         islem-turu of d-islemtur = "5300"
         move "233"    to ws-fis-turu
     else
        MOVE "230" TO WS-FIS-TURU
     end-if

   PERFORM C-SIRA-NO-AL
   IF OK-MSG = 0 AND OK-MSG-ENT = 0
      MOVE WS-GISE-FIS-ACIKLAMA TO WS-FIS-ACIKLAMA
      PERFORM D-FIS-BASLIK
   END-IF.

 INITIALIZE WS-TOPLAM-BORC-TUTAR,  WS-TOPLAM-ALACAK-TUTAR

*once entegrasyon tablosundaki hesap icin fisdetay ve ozethes tablolarina
*kayit insert/update ediliyor.
   MOVE ENT-HESAP-REF-NO   OF D-ENTEG TO WS-HESAP-REF-NO
   MOVE WS-GISE-FIS-ACIKLAMA          TO WS-FIS-ACIKLAMA
   MOVE ENT-TUTAR          OF D-ENTEG TO WS-BORC-TUTAR
   MOVE 0                             TO WS-ALACAK-TUTAR
   MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
   MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

   INITIALIZE D-HESPLAN, WS-DGT-KODU

  PERFORM E10-HESPLANI-KONTROL
  IF OK-MSG = 0 AND OK-MSG-ENT = 0
     PERFORM E30-FIS-ISLEMLERI-DEVAM
  END-IF.

*sonra parametre tablosundan select edilen hesap icin fisdetay ve ozethes
*tablolarina kayit insert/update ediliyor.

*   MOVE GMU-DOVIZ-KASA-REF OF D-PARAM TO WS-HESAP-REF-NO
   move s-kasa-hesap                  to ws-hesap-ref-no
   MOVE WS-GISE-FIS-ACIKLAMA          TO WS-FIS-ACIKLAMA
   MOVE 0                             TO WS-BORC-TUTAR
   MOVE ENT-TUTAR          OF D-ENTEG TO WS-ALACAK-TUTAR
   MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG TO WS-DOVIZ-MIKTAR
   MOVE ENT-DOVIZ-KURU     OF D-ENTEG TO WS-DOVIZ-KURU

   INITIALIZE D-HESPLAN, WS-DGT-KODU

   PERFORM E10-HESPLANI-KONTROL
   IF OK-MSG = 0 AND OK-MSG-ENT = 0
      PERFORM E30-FIS-ISLEMLERI-DEVAM
   END-IF.

   IF WS-TOPLAM-BORC-TUTAR NOT EQUAL WS-TOPLAM-ALACAK-TUTAR
      DISPLAY "FÝÞÝN TOPLAM BORÇ TUTARI VE TOPLAM ALACAK TUTARI EÞÝT OLMALI!"
      PERFORM HATA-VER-WORK
   END-IF.

*doviz islemlerde doviz nazimlarinin da hareket gormesi icin ayrica bir
*mahsup fisi kesiliyor.

*   PERFORM MAHSUP-FISI-DVZ-TEDIYE.

 FIS-TEDIYE-DOVIZ-EXIT.
      EXIT.
*******************************************************************************
 MAHSUP-FISI-DVZ-TEDIYE SECTION.

  MOVE "$DATA18.MUHTAB.ODEMEKOD"                TO WS-HATA-TABLE-NAME
  MOVE WS-KURULUS-KODU            TO GMU-KURULUS-KODU OF D-ODEKOD
  MOVE ENT-DOVIZ-CINSI OF D-ENTEG TO GMU-ODEME-KODU   OF D-ODEKOD

   EXEC SQL
         SELECT GMU_KARSI_HESAP_EFEKTIF_REF_NO,
                GMU_HESAP_EFEKTIF1_REF_NO,
                GMU_HESAP_EFEKTIF2_REF_NO
          INTO :s-kasa-hesap   ,
               :GMU-HESAP-EFEKTIF1-REF-NO OF D-ODEKOD,
               :GMU-HESAP-EFEKTIF2-REF-NO OF D-ODEKOD
      FROM $DATA18.MUHTAB.ODEMEKOD
      WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-ODEKOD AND
              GMU_ODEME_KODU = :GMU-ODEME-KODU   OF D-ODEKOD
      BROWSE ACCESS
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
   WHEN 0
     MOVE GMU-HESAP-ADI OF D-HESPLAN  TO ENT-HESAP-ADI   OF D-ENTEG
**   MOVE GMU-ODEME-KODU OF D-HESPLAN TO ENT-DOVIZ-CINSI OF D-ENTEG
     IF NOT (GMU-ODEME-KODU OF D-HESPLAN = "TRL" OR
             GMU-ODEME-KODU OF D-HESPLAN = "TL " OR
             GMU-ODEME-KODU OF D-HESPLAN = "YTL")
        MOVE ODEME-KODU OF D-ISLEMTUR    TO ENT-DOVIZ-CINSI OF D-ENTEG
     ELSE
        MOVE GMU-ODEME-KODU OF D-HESPLAN TO ENT-DOVIZ-CINSI OF D-ENTEG
     END-IF
   WHEN 100
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
     MOVE "21"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
     GO TO MAHSUP-FISI-DVZ-TEDIYE-EXIT
   WHEN OTHER
     MOVE "5990"        TO WS-RESPONSE-CODE
     MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
     SET WS-FATAL-ERROR TO TRUE
     MOVE "22"          TO WS-RESPONSE-COUNTER
     PERFORM HATA-VER-WORK
     GO TO MAHSUP-FISI-DVZ-TEDIYE-EXIT
   END-EVALUATE.

 MOVE "330" TO WS-FIS-TURU
 PERFORM C-SIRA-NO-AL
   IF OK-MSG = 0 AND OK-MSG-ENT = 0
      PERFORM D-FIS-BASLIK
   END-IF.

 INITIALIZE WS-TOPLAM-BORC-TUTAR,  WS-TOPLAM-ALACAK-TUTAR

*once eodemekod tablosundan select edilen doviz mudi hesabi icin
*fisdetay ve ozethes tablolarina kayit insert/update ediliyor.

*    MOVE GMU-HESAP-DOVIZ1-REF-NO OF D-ODEKOD TO WS-HESAP-REF-NO
     MOVE GMU-HESAP-EFEKTIF2-REF-NO OF D-ODEKOD TO WS-HESAP-REF-NO
     MOVE ENT-DOVIZ-MIKTARI       OF D-ENTEG  TO WS-BORC-TUTAR
     MOVE 0                                   TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI       OF D-ENTEG  TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU          OF D-ENTEG  TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

*simdi de odemekod tablosundan select edilen doviz depo hesabi icin
*fisdetay ve ozethes tablolarina kayit insert/update ediliyor.

*    MOVE GMU-HESAP-DOVIZ2-REF-NO OF D-ODEKOD TO WS-HESAP-REF-NO
     MOVE GMU-HESAP-EFEKTIF1-REF-NO OF D-ODEKOD TO WS-HESAP-REF-NO
     MOVE WS-GISE-FIS-ACIKLAMA                TO WS-FIS-ACIKLAMA
     MOVE 0                                   TO WS-BORC-TUTAR
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG       TO WS-ALACAK-TUTAR
     MOVE ENT-DOVIZ-MIKTARI  OF D-ENTEG       TO WS-DOVIZ-MIKTAR
     MOVE ENT-DOVIZ-KURU     OF D-ENTEG       TO WS-DOVIZ-KURU

     INITIALIZE D-HESPLAN, WS-DGT-KODU

     PERFORM E10-HESPLANI-KONTROL
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E30-FIS-ISLEMLERI-DEVAM
     END-IF.

    IF WS-TOPLAM-BORC-TUTAR NOT EQUAL WS-TOPLAM-ALACAK-TUTAR
       DISPLAY "FÝÞÝN TOPLAM BORÇ TUTARI VE TOPLAM ALACAK TUTARI EÞÝT OLMALI!"
       PERFORM HATA-VER-WORK
    END-IF.

 MAHSUP-FISI-DVZ-TEDIYE-EXIT.
       EXIT.
**********************************************************************************
 A-TAKVIM-KONTROL SECTION.

      MOVE "STAKVIM"              TO WS-HATA-SUBPROG-NAME
      MOVE WS-ISLEM-YIL           TO WS-STAKVIM-YIL
      MOVE WS-ISLEM-AY            TO WS-STAKVIM-AY
      MOVE WS-ISLEM-GUN           TO WS-STAKVIM-GUN

      INITIALIZE WS-STAKVIM-SYS-ERR, WS-STAKVIM-SQL-ERR
      CALL "STAKVIM" USING  WS-STAKVIM-YIL, WS-STAKVIM-AY, WS-STAKVIM-GUN,
                            WS-STAKVIM-SONUC, WS-STAKVIM-KONTROL-FLAG,
                            WS-STAKVIM-HATA-MESAJI, WS-STAKVIM-SQL-ERR,
                            WS-STAKVIM-SYS-ERR

      IF WS-STAKVIM-SQL-ERR NOT EQUAL 0
         MOVE "5930"                 TO WS-RESPONSE-CODE
         MOVE "23"                   TO WS-RESPONSE-COUNTER
         MOVE "WARNING"              TO WS-HATA-MESAJI-TIPI
         MOVE WS-STAKVIM-HATA-MESAJI TO WS-HATA-MESAJI
         MOVE WS-STAKVIM-SQL-ERR TO SQLCODE OF SQLCA
         MOVE WS-STAKVIM-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
***entegrasyon yapilan tarihle ilgili bir problem varsa program diger
***merkezin entegrasyonuna gecmiyor , hersey abort edilip durduruluyor.
***bu yüzden hata alinca STOP RUN  yapan HATA-VER section'a yonlendirildi.
         PERFORM HATA-VER-WORK
     ELSE
        IF WS-STAKVIM-KONTROL-FLAG = "OK"
           CONTINUE
        ELSE
            MOVE "5921"                       TO WS-RESPONSE-CODE
            MOVE "24"                         TO WS-RESPONSE-COUNTER
            MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
            MOVE WS-STAKVIM-HATA-MESAJI TO WS-HATA-MESAJI
            MOVE WS-STAKVIM-SQL-ERR TO SQLCODE OF SQLCA
            MOVE WS-STAKVIM-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
            PERFORM HATA-VER-WORK
        END-IF
     END-IF.

 A-TAKVIM-KONTROL-EXIT.
       EXIT.
******************************************************************************
 B-MIZAN-DONEMI-KAPALIMI SECTION.

  MOVE "=DONKAPA"      TO WS-HATA-TABLE-NAME
  MOVE WS-KURULUS-KODU TO GMU-KURULUS-KODU OF D-DONKAPA
  MOVE WS-ISLEM-YIL    TO GMU-YIL          OF D-DONKAPA
  MOVE WS-ISLEM-AY     TO GMU-AY           OF D-DONKAPA

  EXEC SQL
    SELECT  GMU_DURUM
      INTO :GMU-DURUM OF D-DONKAPA
    FROM =DONKAPA
    WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-DONKAPA AND
                   GMU_YIL = :GMU-YIL          OF D-DONKAPA AND
                    GMU_AY = :GMU-AY           OF D-DONKAPA
    BROWSE ACCESS
  END-EXEC.
  EVALUATE SQLCODE OF SQLCA
    WHEN 0
      IF GMU-DURUM OF D-DONKAPA = "ACIK" OR GMU-DURUM OF D-DONKAPA = "AÇIK"
         CONTINUE
      ELSE
         MOVE "5921"    TO WS-RESPONSE-CODE
         MOVE "GÝRMEK ÝSTEDÝÐÝNÝZ FÝÞE AÝT MÝZAN DÖNEMÝ KAPATILMIÞTIR!" TO
                                                             WS-HATA-MESAJI
         MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
         MOVE "25"      TO WS-RESPONSE-COUNTER
         PERFORM HATA-VER-WORK
         GO TO B-MIZAN-DONEMI-KAPALIMI-EXIT
      END-IF
    WHEN 100
      MOVE 0 TO SQLCODE OF SQLCA
      CONTINUE
    WHEN OTHER
      MOVE "5990"        TO WS-RESPONSE-CODE
      MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
      SET WS-FATAL-ERROR TO TRUE
      MOVE "26"          TO WS-RESPONSE-COUNTER
      PERFORM HATA-VER-WORK
   END-EVALUATE.

 B-MIZAN-DONEMI-KAPALIMI-EXIT.
                 EXIT.
******************************************************************************
 C-SIRA-NO-AL SECTION.

        MOVE "SEFSIRA"                  TO WS-HATA-SUBPROG-NAME
        MOVE WS-KURULUS-KODU            TO WS-SEFSIRA-KURULUS-KODU
        MOVE ENT-BOLGE-KODU OF D-ENTEG  TO WS-SEFSIRA-BOLGE-KODU
        MOVE ENT-MERKEZ-NO  OF D-ENTEG  TO WS-SEFSIRA-MERKEZ-NO
        MOVE ENT-SUBE-NO    OF D-ENTEG  TO WS-SEFSIRA-SUBE-NO
        MOVE ENT-GISE-NO    OF D-ENTEG  TO WS-SEFSIRA-GISE-NO
        MOVE WS-FIS-TURU                TO WS-SEFSIRA-FIS-TURU
        MOVE WS-ISLEM-YIL               TO WS-SEFSIRA-YIL
        MOVE WS-ISLEM-AY                TO WS-SEFSIRA-AY
        MOVE WS-ISLEM-GUN               TO WS-SEFSIRA-GUN

        INITIALIZE WS-SEFSIRA-SYS-ERR, WS-SEFSIRA-SQL-ERR, WS-SEFSIRA-SIRA-NO
        CALL "SEFSIRA" USING  WS-SEFSIRA-KURULUS-KODU, WS-SEFSIRA-BOLGE-KODU,
                              WS-SEFSIRA-MERKEZ-NO, WS-SEFSIRA-SUBE-NO,
                              WS-SEFSIRA-GISE-NO, WS-SEFSIRA-FIS-TURU,
                              WS-SEFSIRA-YIL, WS-SEFSIRA-AY, WS-SEFSIRA-GUN,
                              WS-SEFSIRA-SIRA-NO, WS-SEFSIRA-SQL-ERR,
                              WS-SEFSIRA-SYS-ERR

        IF WS-SEFSIRA-SQL-ERR NOT EQUAL 0
           MOVE "5921"    TO WS-RESPONSE-CODE
           STRING "SEFSIRA SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
           DELIMITED BY SIZE  INTO WS-HATA-MESAJI
           MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
           MOVE "27"      TO WS-RESPONSE-COUNTER
           MOVE WS-SEFSIRA-SQL-ERR TO SQLCODE OF SQLCA
           MOVE WS-SEFSIRA-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
           PERFORM HATA-VER-WORK
        ELSE
          CONTINUE
        END-IF.

 C-SIRA-NO-AL-EXIT.
       EXIT.
******************************************************************************
 D-FIS-BASLIK SECTION.

   MOVE "=ISLEMID"                  TO WS-HATA-TABLE-NAME
   MOVE WS-KURULUS-KODU             TO GMU-KURULUS-KODU OF D-ISLEMID
   MOVE ENT-ISLEM-YIL    OF D-ENTEG TO GMU-ISLEM-YIL    OF D-ISLEMID
   MOVE ENT-BOLGE-KODU   OF D-ENTEG TO GMU-BOLGE-KODU   OF D-ISLEMID
   MOVE ENT-MERKEZ-NO    OF D-ENTEG TO GMU-MERKEZ-NO    OF D-ISLEMID


   EXEC SQL
     SELECT GMU_ISLEM_ID INTO :GMU-ISLEM-ID OF D-ISLEMID
     FROM =ISLEMID
     WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-ISLEMID AND
              GMU_ISLEM_YIL = :GMU-ISLEM-YIL    OF D-ISLEMID AND
             GMU_BOLGE_KODU = :GMU-BOLGE-KODU   OF D-ISLEMID AND
              GMU_MERKEZ_NO = :GMU-MERKEZ-NO    OF D-ISLEMID
     BROWSE ACCESS
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
     WHEN 0
       CONTINUE
     WHEN 100
       MOVE 0 TO SQLCODE OF SQLCA
       MOVE 0 TO GMU-ISLEM-ID OF D-ISLEMID
     WHEN OTHER
       MOVE "5990"        TO WS-RESPONSE-CODE
       MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
       SET WS-FATAL-ERROR TO TRUE
       MOVE "28"          TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK
   END-EVALUATE.

   MOVE "SFISBAS"                  TO WS-HATA-SUBPROG-NAME
   MOVE WS-KURULUS-KODU            TO WS-SFISBAS-KURULUS-KODU
   MOVE ENT-BOLGE-KODU OF D-ENTEG  TO WS-SFISBAS-BOLGE-KODU
   MOVE ENT-MERKEZ-NO  OF D-ENTEG  TO WS-SFISBAS-MERKEZ-NO
   MOVE ENT-SUBE-NO    OF D-ENTEG  TO WS-SFISBAS-SUBE-NO
   MOVE ENT-GISE-NO    OF D-ENTEG  TO WS-SFISBAS-GISE-NO
   MOVE WS-ISLEM-YIL               TO WS-SFISBAS-ISLEM-YIL
   MOVE WS-ISLEM-AY                TO WS-SFISBAS-ISLEM-AY
   MOVE WS-ISLEM-GUN               TO WS-SFISBAS-ISLEM-GUN
   MOVE WS-FIS-TURU                TO WS-SFISBAS-FIS-TURU

   MOVE FUNCTION CURRENT-DATE(1:8) TO WS-CURRENT-DATE

   MOVE WS-SEFSIRA-SIRA-NO TO WS-SFISBAS-FIS-NO

     MOVE WS-FIS-ACIKLAMA  TO WS-SFISBAS-FIS-ACIKLAMA
     MOVE 0                TO WS-SFISBAS-KARSI-BOLGE-KODU
     MOVE 0                TO WS-SFISBAS-KARSI-MERKEZ-NO
     MOVE 0                TO WS-SFISBAS-KARSI-BELGE-YIL
     MOVE 0                TO WS-SFISBAS-KARSI-BELGE-AY
     MOVE 0                TO WS-SFISBAS-KARSI-BELGE-GUN
     MOVE SPACE            TO WS-SFISBAS-KARSI-BELGE-TURU
     MOVE 0                TO WS-SFISBAS-KARSI-BELGE-NO
     MOVE SPACE            TO WS-SFISBAS-KASA-ONAY
     MOVE 1                TO WS-SFISBAS-FIS-STATUS
     MOVE WS-ISLEM-YIL     TO WS-SFISBAS-VALOR-YIL
     MOVE WS-ISLEM-AY      TO WS-SFISBAS-VALOR-AY
     MOVE WS-ISLEM-GUN     TO WS-SFISBAS-VALOR-GUN
     MOVE 0                TO WS-SFISBAS-MADDE-NO
     MOVE 0                TO WS-SFISBAS-DEFTER
     MOVE 999999           TO WS-SFISBAS-EKL-SICIL-NO
     COMPUTE WS-SFISBAS-ISLEM-ID = GMU-ISLEM-ID OF D-ISLEMID + 1

     COMPUTE WS-VALOR-TARIHI = WS-ISLEM-YIL * 10000 +
                               WS-ISLEM-AY  * 100   +
                               WS-ISLEM-GUN
  CALL "SFISBAS" USING WS-SFISBAS-KURULUS-KODU, WS-SFISBAS-BOLGE-KODU,
                       WS-SFISBAS-MERKEZ-NO, WS-SFISBAS-SUBE-NO,
                       WS-SFISBAS-GISE-NO,   WS-SFISBAS-ISLEM-YIL,
                       WS-SFISBAS-ISLEM-AY,  WS-SFISBAS-ISLEM-GUN,
                       WS-SFISBAS-FIS-TURU,  WS-SFISBAS-FIS-NO,
                       WS-SFISBAS-ISLEM-ID,  WS-SFISBAS-FIS-ACIKLAMA,
                       WS-SFISBAS-KARSI-BOLGE-KODU, WS-SFISBAS-KARSI-MERKEZ-NO,
                       WS-SFISBAS-KARSI-BELGE-YIL, WS-SFISBAS-KARSI-BELGE-AY,
                       WS-SFISBAS-KARSI-BELGE-GUN, WS-SFISBAS-KARSI-BELGE-TURU,
                       WS-SFISBAS-KARSI-BELGE-NO, WS-SFISBAS-KASA-ONAY,
                       WS-SFISBAS-FIS-STATUS, WS-SFISBAS-VALOR-YIL,
                       WS-SFISBAS-VALOR-AY,   WS-SFISBAS-VALOR-GUN,
                       WS-SFISBAS-MADDE-NO,   WS-SFISBAS-DEFTER,
                       WS-SFISBAS-EKL-SICIL-NO, WS-SFISBAS-KONTROL-FLAG,
                       WS-SFISBAS-HATA-MESAJI,  WS-SFISBAS-SQL-ERR,
                       WS-SFISBAS-SYS-ERR.
   IF WS-SFISBAS-SQL-ERR NOT EQUAL 0
     MOVE "5930"                 TO WS-RESPONSE-CODE
     MOVE "29"                   TO WS-RESPONSE-COUNTER
     MOVE "WARNING"              TO WS-HATA-MESAJI-TIPI
     MOVE WS-SFISBAS-HATA-MESAJI TO WS-HATA-MESAJI
     MOVE WS-SFISBAS-SQL-ERR TO SQLCODE OF SQLCA
     MOVE WS-SFISBAS-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
     PERFORM HATA-VER-WORK
  ELSE
     IF WS-SFISBAS-KONTROL-FLAG = "OK"
        CONTINUE
     ELSE
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "30"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        MOVE WS-SFISBAS-HATA-MESAJI TO WS-HATA-MESAJI
        MOVE WS-SFISBAS-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SFISBAS-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
      END-IF
   END-IF.

  D-FIS-BASLIK-EXIT.
       EXIT.
*******************************************************************************
 E10-HESPLANI-KONTROL SECTION.

  MOVE "SHESPLA"          TO WS-HATA-SUBPROG-NAME
  MOVE WS-KURULUS-KODU   TO WS-SHESPLA-KURULUS-KODU
  MOVE WS-HESAP-REF-NO    TO WS-SHESPLA-HES-REF-NO

  INITIALIZE WS-SHESPLA-SYS-ERR, WS-SHESPLA-SQL-ERR, WS-SHESPLA-KONTROL-FLAG
  CALL "SHESPLA" USING WS-SHESPLA-KURULUS-KODU, WS-SHESPLA-HES-REF-NO,
                       WS-SHESPLA-KONTROL-FLAG, WS-SHESPLA-SQL-ERR,
                       WS-SHESPLA-SYS-ERR.

  IF WS-SHESPLA-SQL-ERR NOT EQUAL 0
     IF WS-SHESPLA-SQL-ERR NOT EQUAL 100
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING "SHESPLA SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
          DELIMITED BY SIZE  INTO WS-HATA-MESAJI
          DISPLAY "HESAP-NO :"  WS-SHESPLA-HES-REF-NO
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "31"      TO WS-RESPONSE-COUNTER
          MOVE WS-SHESPLA-SQL-ERR TO SQLCODE OF SQLCA
          MOVE WS-SHESPLA-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
          PERFORM HATA-VER-WORK
     ELSE
          MOVE "5921"    TO WS-RESPONSE-CODE
          STRING "GÝRDÝÐÝNÝZ HESAP NUMARASI GEÇERLÝ DEÐÝL!"
          DELIMITED BY SIZE  INTO WS-HATA-MESAJI
          DISPLAY "HESAP-NO :"  WS-SHESPLA-HES-REF-NO
          DISPLAY "ISLEM-TURU : " IOISLEM-TURU OF D-OZET
          MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
          MOVE "32"      TO WS-RESPONSE-COUNTER
          MOVE WS-SHESPLA-SQL-ERR TO SQLCODE OF SQLCA
          MOVE WS-SHESPLA-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
          PERFORM HATA-VER-WORK
     END-IF
  ELSE
     CONTINUE
  END-IF.

  MOVE "=HESPLANI" TO WS-HATA-TABLE-NAME
  MOVE WS-KURULUS-KODU    TO GMU-KURULUS-KODU OF D-HESPLAN
  MOVE WS-HESAP-REF-NO    TO GMU-HESAP-REF-NO OF D-HESPLAN

     EXEC SQL
       SELECT GMU_DETAY_DURUMU,GMU_BUTCE_DURUMU,
              GMU_YANSITMA_DURUMU,GMU_HESAP_SINIF,
              GMU_DGT_TIPI,GMU_YRD_KART_DURUMU,
              GMU_ODEME_KODU,GMU_HESAP_ADI
         INTO :GMU-DETAY-DURUMU     OF D-HESPLAN,
              :GMU-BUTCE-DURUMU     OF D-HESPLAN,
              :GMU-YANSITMA-DURUMU  OF D-HESPLAN,
              :GMU-HESAP-SINIF      OF D-HESPLAN,
              :GMU-DGT-TIPI         OF D-HESPLAN,
              :GMU-YRD-KART-DURUMU  OF D-HESPLAN,
              :GMU-ODEME-KODU       OF D-HESPLAN,
              :GMU-HESAP-ADI        OF D-HESPLAN
       FROM =HESPLANI
       WHERE GMU_KURULUS_KODU = :GMU-KURULUS-KODU OF D-HESPLAN AND
             GMU_HESAP_REF_NO = :GMU-HESAP-REF-NO OF D-HESPLAN
       BROWSE ACCESS
     END-EXEC.
     EVALUATE SQLCODE OF SQLCA
        WHEN 0
          IF GMU-DETAY-DURUMU OF D-HESPLAN = "U"
             PERFORM Z-HESAP-NO-BUL
             MOVE "5921"    TO WS-RESPONSE-CODE
             STRING WS-SHESNO-HESAP-NO  DELIMITED BY SPACE
             " HESABI DETAY HESABI DEÐÝL,LÜTFEN" DELIMITED BY SIZE
             " YENÝ HESAP SEÇÝNÝZ!" DELIMITED BY SIZE INTO WS-HATA-MESAJI
             MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
             MOVE "33"      TO WS-RESPONSE-COUNTER
             PERFORM HATA-VER-WORK
          END-IF
*******umitle g”rsld bu sekilde yapilmayacak.sezer 17.06.2015
*          IF GMU-YRD-KART-DURUMU OF D-HESPLAN = "E"
*         PERFORM Z-HESAP-NO-BUL
*           display "-------------------------------------"
*           display " islem-turu : " islem-turu of d-islemtur
*           display "-------------------------------------"
*           DISPLAY " HESAP-REF-NO : " GMU-HESAP-REF-NO OF D-HESPLAN
*            MOVE "5921"    TO WS-RESPONSE-CODE
*            STRING WS-SHESNO-HESAP-NO  DELIMITED BY SPACE
*            " HESABI YARDIMCI KARTLA ALIAN BR HESAPTIR "
*       DELIMITED BY SIZE INTO WS-HATA-MESAJI
*    MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
*    MOVE "50"      TO WS-RESPONSE-COUNTER
*    PERFORM HATA-VER-WORK
*    end-if
************************************************************

        WHEN 100
     display "-------------------------------------"
     display " islem-turu : " islem-turu of d-islemtur
     display "-------------------------------------"
     DISPLAY " HESAP-REF-NO : " GMU-HESAP-REF-NO OF D-HESPLAN

          MOVE "5990"        TO WS-RESPONSE-CODE
          MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
          MOVE "34"          TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
         WHEN OTHER
     display "-------------------------------------"
     display " islem-turu : " islem-turu of d-islemtur
     display "-------------------------------------"
     DISPLAY " HESAP-REF-NO : " GMU-HESAP-REF-NO OF D-HESPLAN
          MOVE "5990"        TO WS-RESPONSE-CODE
          MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
          SET WS-FATAL-ERROR TO TRUE
          MOVE "35"          TO WS-RESPONSE-COUNTER
          PERFORM HATA-VER-WORK
     END-EVALUATE.

 E10-HESPLANI-KONTROL-EXIT.
       EXIT.
******************************************************************************
 E20-KDV-KONTROL SECTION.

    MOVE "=HESPLANI"       TO WS-HATA-TABLE-NAME
    MOVE WS-KURULUS-KODU   TO GMU-KURULUS-KODU OF D-HESPLAN
    MOVE WS-HESAP-REF-NO   TO GMU-HESAP-REF-NO OF D-HESPLAN
    INITIALIZE WS-FLAG4    ,  ws-flag5 , ws-flag6

   EXEC SQL
      SELECT GMU_BUTCE_DURUMU,
             GMU_KDV_ORAN,
             GMU_KDV_HESAP_REF_NO,
             GMU_KDV
      INTO :GMU-BUTCE-DURUMU     OF D-HESPLAN,
           :GMU-KDV-ORAN         OF D-HESPLAN,
           :GMU-KDV-HESAP-REF-NO OF D-HESPLAN,
           :GMU-KDV              OF D-HESPLAN
      FROM =HESPLANI
      WHERE   GMU_KURULUS_KODU = :GMU-KURULUS-KODU  OF D-HESPLAN AND
              GMU_HESAP_REF_NO = :GMU-HESAP-REF-NO  OF D-HESPLAN
      BROWSE ACCESS
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
     WHEN 0
         IF
**hgs ve 380 li hesaplar i‡in kapatildi(28.12.2016)
**        GMU-BUTCE-DURUMU OF D-HESPLAN = "GG"              AND
          GMU-KDV-ORAN OF D-HESPLAN NOT EQUAL 0             AND
          GMU-KDV-HESAP-REF-NO OF D-HESPLAN NOT EQUAL SPACE
**        WS-ALACAK-TUTAR > 0
             SET WS-KDV-VAR-FLAG TO TRUE
             PERFORM E20-1-KDV-HESAPLA
       END-IF
     WHEN 100
     display "-------------------------------------"
     display " islem-turu : " islem-turu of d-islemtur
     display "-------------------------------------"
     DISPLAY " HESAP-REF-NO : " GMU-HESAP-REF-NO OF D-HESPLAN

       MOVE "5990"        TO WS-RESPONSE-CODE
       MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
       MOVE "36"          TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK
     WHEN OTHER
     display "-------------------------------------"
     display " islem-turu : " islem-turu of d-islemtur
     display "-------------------------------------"
     DISPLAY " HESAP-REF-NO : " GMU-HESAP-REF-NO OF D-HESPLAN

       MOVE "5990"        TO WS-RESPONSE-CODE
       MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
       SET WS-FATAL-ERROR TO TRUE
       MOVE "37"          TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK
   END-EVALUATE.

 E20-KDV-KONTROL-EXIT.
      EXIT.
******************************************************************************
 E20-1-KDV-HESAPLA SECTION.

  IF GMU-KDV-ORAN OF D-HESPLAN > 0
     IF GMU-KDV EQUAL SPACE
        MOVE "5921"    TO WS-RESPONSE-CODE
        STRING "HESAP PLANINDA KDV DAHÝL/HARÝÇ BÝLGÝSÝ TANIMLANMAMIÞ!"
        DELIMITED BY SIZE INTO WS-HATA-MESAJI
        MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
        MOVE "38"      TO WS-RESPONSE-COUNTER
        PERFORM HATA-VER-WORK
      END-IF
   END-IF

   IF GMU-KDV OF D-HESPLAN = "D"
      MOVE GMU-KDV-HESAP-REF-NO OF D-HESPLAN TO WS-KDV-HESAP-REF-NO
      SET WS-KDV-DAHIL-FLAG TO TRUE
   END-IF.

   IF GMU-KDV OF D-HESPLAN = "H"
      MOVE GMU-KDV-HESAP-REF-NO OF D-HESPLAN TO WS-KDV-HESAP-REF-NO
      SET WS-KDV-HARIC-FLAG TO TRUE
   END-IF.

 IF WS-KDV-DAHIL-FLAG
    IF WS-ALACAK-TUTAR > 0
       MOVE WS-ALACAK-TUTAR TO WS-TEMP-TUTAR
    END-IF
    IF WS-BORC-TUTAR > 0
       MOVE WS-BORC-TUTAR TO WS-TEMP-TUTAR
    END-IF

    COMPUTE WS-KDV-TUTAR ROUNDED = (WS-TEMP-TUTAR * GMU-KDV-ORAN OF D-HESPLAN)/
                                   (100 + GMU-KDV-ORAN OF D-HESPLAN)
    COMPUTE WS-TEMP-TUTAR = WS-TEMP-TUTAR - WS-KDV-TUTAR
    IF WS-ALACAK-TUTAR > 0
       MOVE WS-TEMP-TUTAR TO WS-ALACAK-TUTAR
    END-IF
    IF WS-BORC-TUTAR > 0
       MOVE WS-TEMP-TUTAR TO WS-BORC-TUTAR
    END-IF
  END-IF.

  IF WS-KDV-HARIC-FLAG
    IF WS-ALACAK-TUTAR > 0
       MOVE WS-ALACAK-TUTAR TO WS-TEMP-TUTAR
    END-IF
    IF WS-BORC-TUTAR > 0
       MOVE WS-BORC-TUTAR TO WS-TEMP-TUTAR
    END-IF

    COMPUTE WS-KDV-TUTAR ROUNDED = (WS-TEMP-TUTAR * GMU-KDV-ORAN OF D-HESPLAN)/
                                   (100)
    COMPUTE WS-TEMP-TUTAR = WS-TEMP-TUTAR - WS-KDV-TUTAR
    IF WS-ALACAK-TUTAR > 0
       MOVE WS-TEMP-TUTAR TO WS-ALACAK-TUTAR
    END-IF
    IF WS-BORC-TUTAR > 0
       MOVE WS-TEMP-TUTAR TO WS-BORC-TUTAR
    END-IF
  END-IF.



*  IF GMU-KDV OF D-HESPLAN = "H"
*     IF IN-HESAP-REF-NO(I-SAY) = GMU-KDV-HESAP-REF-NO
*       MOVE 1 TO WS-KDV-HESAP-ADET
*     END-IF
*     IF I-SAY = IN-FIS-DETAY-ADET
*        IF WS-KDV-HESAP-ADET = 0
*           MOVE "5921"    TO WS-RESPONSE-CODE
*           STRING "GELÝR HESABININ KDV'SÝ HARÝÇ OLDUÐU ÝÇÝN "
*           DELIMITED BY SIZE
*           "KDV HESABI VE TUTARINI GÝRMEYÝ UNUTMAYINIZ!"
*           DELIMITED BY SIZE INTO WS-HATA-MESAJI
*           MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
*           MOVE "7A"      TO WS-RESPONSE-COUNTER
*           PERFORM HATA-VER
*           GO TO D70-1-KDV-KONTROL-EXIT
*        END-IF
*     END-IF
*  END-IF.

*  IF GMU-KDV OF D-HESPLAN = "D"
*     IF IN-BORC-TUTAR(I-SAY) > 0
*        MOVE IN-BORC-TUTAR(I-SAY) TO WS-TEMP-TUTAR
*     END-IF
*     IF IN-ALACAK-TUTAR(I-SAY) > 0
*        MOVE IN-ALACAK-TUTAR(I-SAY) TO WS-TEMP-TUTAR
*     END-IF
*     COMPUTE WS-KESILEN-KDV ROUNDED =
*      (WS-TEMP-TUTAR * GMU-KDV-ORAN OF D-HESPLAN)/
*      (100 + GMU-KDV-ORAN OF D-HESPLAN)
*     COMPUTE WS-TEMP-TUTAR = WS-TEMP-TUTAR - WS-KESILEN-KDV
*     IF IN-BORC-TUTAR(I-SAY) > 0
*        MOVE WS-KESILEN-KDV TO IN-BORC-TUTAR(I-SAY)
*     END-IF
*     IF IN-ALACAK-TUTAR(I-SAY) > 0
*        MOVE WS-KESILEN-KDV TO IN-ALACAK-TUTAR(I-SAY)
*     END-IF
*  END-IF

** IF GMU-KDV OF D-HESPLAN = "H"
**    IF IN-BORC-TUTAR(I-SAY) > 0
**       MOVE IN-BORC-TUTAR(I-SAY) TO WS-TEMP-TUTAR
**    END-IF
**    IF IN-ALACAK-TUTAR(I-SAY) > 0
**       MOVE IN-ALACAK-TUTAR(I-SAY) TO WS-TEMP-TUTAR
**    END-IF
**    COMPUTE WS-KESILEN-KDV ROUNDED =
**     (WS-TEMP-TUTAR * GMU-KDV-ORAN OF D-HESPLAN)/ 100
**    COMPUTE WS-TEMP-TUTAR = WS-TEMP-TUTAR + WS-KESILEN-KDV
**    IF IN-BORC-TUTAR(I-SAY) > 0
**       MOVE WS-TEMP-TUTAR TO IN-BORC-TUTAR(I-SAY)
**    END-IF
**    IF IN-ALACAK-TUTAR(I-SAY) > 0
**       MOVE WS-TEMP-TUTAR TO IN-ALACAK-TUTAR(I-SAY)
**    END-IF
** END-IF

*   MOVE IN-HESAP-REF-NO(I-SAY) TO WS-TEMP-REF-NO

*   IF OK-MSG = 0 AND GMU-KDV OF D-HESPLAN = "D"
*      MOVE GMU-KDV-HESAP-REF-NO OF D-HESPLAN TO IN-HESAP-REF-NO(I-SAY)
*      PERFORM E80-FIS-DETAY
*        IF OK-MSG = 0
*           PERFORM E90-UPDATE-OZETHES
*        END-IF
*   END-IF.

*   IF OK-MSG = 0 AND GMU-KDV OF D-HESPLAN = "D"
*      MOVE WS-TEMP-REF-NO TO IN-HESAP-REF-NO(I-SAY)
*      IF IN-BORC-TUTAR(I-SAY) > 0
*         MOVE WS-TEMP-TUTAR TO IN-BORC-TUTAR(I-SAY)
*      END-IF
*      IF IN-ALACAK-TUTAR(I-SAY) > 0
*         MOVE WS-TEMP-TUTAR TO IN-ALACAK-TUTAR(I-SAY)
*      END-IF
*   END-IF.

 E20-1-KDV-HESAPLA-EXIT.
     EXIT.
*******************************************************************************
 E30-FIS-ISLEMLERI-DEVAM SECTION.

     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E40-FIS-TUTAR-KONTROL
     END-IF
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM F60-DAGITIM-TIPI-KONTROL
     END-IF


     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E50-FIS-DETAY
     END-IF
     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        PERFORM E60-UPDATE-OZETHES
     END-IF

     IF OK-MSG = 0 AND OK-MSG-ENT = 0
        COMPUTE WS-TOPLAM-BORC-TUTAR   = WS-TOPLAM-BORC-TUTAR   +
                                         WS-BORC-TUTAR
        COMPUTE WS-TOPLAM-ALACAK-TUTAR = WS-TOPLAM-ALACAK-TUTAR +
                                         WS-ALACAK-TUTAR
     END-IF.

 E30-FIS-ISLEMLERI-DEVAM-EXIT.
       EXIT.
*******************************************************************************
 E40-FIS-TUTAR-KONTROL SECTION.

    IF WS-BORC-TUTAR = 0 AND WS-ALACAK-TUTAR = 0
       MOVE "5921"    TO WS-RESPONSE-CODE
       STRING "FÝÞ TUTARI SIFIRDAN FARKLI OLMALI!"
       DELIMITED BY SIZE INTO WS-HATA-MESAJI
       MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
       MOVE "39"      TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK
    END-IF.

    IF WS-BORC-TUTAR > 0 AND WS-ALACAK-TUTAR > 0
       PERFORM Z-HESAP-NO-BUL
       MOVE "5921"    TO WS-RESPONSE-CODE
       STRING WS-SHESNO-HESAP-NO  DELIMITED BY SPACE
       " HESABI HEM BORÇ HEM ALACAK ÇALIÞAMAZ!"
       DELIMITED BY SIZE INTO WS-HATA-MESAJI
       MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
       MOVE "40"      TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK
    END-IF.

 E40-FIS-TUTAR-KONTROL-EXIT.
         EXIT.
******************************************************************************
 E50-FIS-DETAY SECTION.

   MOVE "SFISDET"                 TO WS-HATA-SUBPROG-NAME
   MOVE WS-KURULUS-KODU           TO WS-SFISDET-KURULUS-KODU
   MOVE ENT-BOLGE-KODU OF D-ENTEG TO WS-SFISDET-BOLGE-KODU
   MOVE ENT-MERKEZ-NO OF D-ENTEG  TO WS-SFISDET-MERKEZ-NO
   MOVE ENT-SUBE-NO OF D-ENTEG    TO WS-SFISDET-SUBE-NO
   MOVE ENT-GISE-NO OF D-ENTEG    TO WS-SFISDET-GISE-NO
   MOVE WS-ISLEM-YIL              TO WS-SFISDET-ISLEM-YIL
   MOVE WS-ISLEM-AY               TO WS-SFISDET-ISLEM-AY
   MOVE WS-ISLEM-GUN              TO WS-SFISDET-ISLEM-GUN
   MOVE WS-FIS-TURU               TO WS-SFISDET-FIS-TURU

   MOVE FUNCTION CURRENT-DATE(1:8) TO WS-CURRENT-DATE

   MOVE WS-SEFSIRA-SIRA-NO TO WS-SFISDET-FIS-NO

   IF WS-SFISDET-SIRA-NO EQUAL WS-ONCEKI-FIS-SIRA-NO AND
      WS-SFISDET-FIS-TURU EQUAL WS-ONCEKI-FIS-TURU
      ADD  1 TO WS-DETAY-SIRA-NO
   ELSE
      MOVE 1 TO WS-DETAY-SIRA-NO
   END-IF.

   MOVE WS-HESAP-REF-NO              TO WS-SFISDET-HESAP-REF-NO
   MOVE WS-FIS-ACIKLAMA              TO WS-SFISDET-FIS-ACIKLAMA
   MOVE WS-DETAY-SIRA-NO             TO WS-SFISDET-SIRA-NO
   MOVE GMU-DGT-TIPI OF D-HESPLAN    TO WS-SFISDET-DGT-TIPI
   MOVE WS-DGT-KODU                  TO WS-SFISDET-DGT-KODU
   MOVE SPACE                        TO WS-SFISDET-YRD-KART-NO
   MOVE SPACE                        TO WS-SFISDET-YRD-KART-TIPI
   MOVE WS-BORC-TUTAR                TO WS-SFISDET-BORC-TUTAR
   MOVE WS-ALACAK-TUTAR              TO WS-SFISDET-ALACAK-TUTAR
   MOVE SPACE                        TO WS-SFISDET-KARSI-DGT-TIPI
   MOVE SPACE                        TO WS-SFISDET-KARSI-DGT-KODU
   MOVE WS-DOVIZ-KURU                TO WS-SFISDET-KUR
   MOVE WS-DOVIZ-MIKTAR              TO WS-SFISDET-DOVIZ-MIKTAR
** MOVE GMU-ODEME-KODU OF D-HESPLAN  TO WS-SFISDET-ODEME-KODU
   MOVE ENT-DOVIZ-CINSI OF D-ENTEG   TO WS-SFISDET-ODEME-KODU
   MOVE 1                            TO WS-SFISDET-FIS-STATUS
   MOVE 999999                       TO WS-SFISDET-EKL-SICIL-NO

   MOVE WS-SFISDET-SIRA-NO  TO WS-ONCEKI-FIS-SIRA-NO
   MOVE WS-SFISDET-FIS-TURU TO WS-ONCEKI-FIS-TURU

  CALL "SFISDET" USING WS-SFISDET-KURULUS-KODU, WS-SFISDET-BOLGE-KODU,
                       WS-SFISDET-MERKEZ-NO, WS-SFISDET-SUBE-NO,
                       WS-SFISDET-GISE-NO,   WS-SFISDET-ISLEM-YIL,
                       WS-SFISDET-ISLEM-AY,  WS-SFISDET-ISLEM-GUN,
                       WS-SFISDET-FIS-TURU,  WS-SFISDET-FIS-NO,
                       WS-SFISDET-HESAP-REF-NO, WS-SFISDET-FIS-ACIKLAMA,
                       WS-SFISDET-SIRA-NO, WS-SFISDET-DGT-TIPI,
                       WS-SFISDET-DGT-KODU, WS-SFISDET-YRD-KART-NO,
                       WS-SFISDET-YRD-KART-TIPI, WS-SFISDET-BORC-TUTAR,
                       WS-SFISDET-ALACAK-TUTAR, WS-SFISDET-KARSI-DGT-TIPI,
                       WS-SFISDET-KARSI-DGT-KODU, WS-SFISDET-KUR,
                       WS-SFISDET-DOVIZ-MIKTAR  , WS-SFISDET-ODEME-KODU,
                       WS-SFISDET-FIS-STATUS,
                        WS-SFISDET-EKL-SICIL-NO,
                       WS-SFISDET-KONTROL-FLAG, WS-SFISDET-HATA-MESAJI,
                       WS-SFISDET-SQL-ERR,    WS-SFISDET-SYS-ERR.

   IF WS-SFISDET-SQL-ERR NOT EQUAL 0
     MOVE "5930"                 TO WS-RESPONSE-CODE
     MOVE "41"                   TO WS-RESPONSE-COUNTER
     MOVE "WARNING"              TO WS-HATA-MESAJI-TIPI
     MOVE WS-SFISDET-HATA-MESAJI TO WS-HATA-MESAJI
     MOVE WS-SFISDET-SQL-ERR TO SQLCODE OF SQLCA
     MOVE WS-SFISDET-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
     PERFORM HATA-VER-WORK
  ELSE
     IF WS-SFISDET-KONTROL-FLAG = "OK"
        CONTINUE
     ELSE
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "42"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        MOVE WS-SFISDET-HATA-MESAJI TO WS-HATA-MESAJI
        MOVE WS-SFISDET-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SFISDET-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
      END-IF
   END-IF.

  E50-FIS-DETAY-EXIT.
      EXIT.
*****************************************************************************
  E60-UPDATE-OZETHES SECTION.

   MOVE "SENTHES"                   TO WS-HATA-SUBPROG-NAME
   MOVE WS-KURULUS-KODU             TO WS-SOZTHES-KURULUS-KODU
   MOVE ENT-BOLGE-KODU OF D-ENTEG   TO WS-SOZTHES-BOLGE-KODU
   MOVE ENT-MERKEZ-NO  OF D-ENTEG   TO WS-SOZTHES-MERKEZ-NO
   MOVE ENT-SUBE-NO OF D-ENTEG  TO WS-SOZTHES-SUBE-NO
   MOVE ENT-GISE-NO OF D-ENTEG  TO WS-SOZTHES-GISE-NO
   MOVE S-ISLEM-YY              TO WS-SOZTHES-ISLEM-YIL
   MOVE S-ISLEM-MM              TO WS-SOZTHES-ISLEM-AY
   MOVE S-ISLEM-DD              TO WS-SOZTHES-ISLEM-GUN
   MOVE WS-HESAP-REF-NO         TO WS-SOZTHES-HESAP-REF-NO
   MOVE WS-FIS-TURU             TO WS-SOZTHES-FIS-TURU
   MOVE WS-BORC-TUTAR           TO WS-SOZTHES-BORC-TUTAR
   MOVE WS-ALACAK-TUTAR         TO WS-SOZTHES-ALACAK-TUTAR
   MOVE 999999                  TO WS-SOZTHES-SICIL-NO

  INITIALIZE WS-SOZTHES-SYS-ERR, WS-SOZTHES-SQL-ERR, WS-SOZTHES-KONTROL-FLAG
  CALL "SENTHES" USING WS-SOZTHES-KURULUS-KODU, WS-SOZTHES-BOLGE-KODU,
                       WS-SOZTHES-MERKEZ-NO, WS-SOZTHES-SUBE-NO,
                       WS-SOZTHES-GISE-NO, WS-SOZTHES-ISLEM-YIL,
                       WS-SOZTHES-ISLEM-AY, WS-SOZTHES-ISLEM-GUN,
                       WS-SOZTHES-HESAP-REF-NO, WS-SOZTHES-FIS-TURU,
                       WS-SOZTHES-BORC-TUTAR, WS-SOZTHES-ALACAK-TUTAR,
                       WS-SOZTHES-SICIL-NO, WS-SOZTHES-KONTROL-FLAG,
                       WS-SOZTHES-SQL-ERR, WS-SOZTHES-SYS-ERR.
  IF WS-SOZTHES-SQL-ERR NOT EQUAL 0
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "43"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        STRING "SOZTHES SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
        DELIMITED BY SIZE  INTO WS-HATA-MESAJI
        MOVE WS-SOZTHES-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SOZTHES-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
  ELSE
     IF WS-SOZTHES-KONTROL-FLAG = "OK"
        CONTINUE
     ELSE
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "44"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        STRING "SENTHES SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
        DELIMITED BY SIZE  INTO WS-HATA-MESAJI
        MOVE WS-SOZTHES-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SOZTHES-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
     END-IF
  END-IF.

 E60-UPDATE-OZETHES-EXIT.
       EXIT.
****************************************************************************

  F60-DAGITIM-TIPI-KONTROL SECTION.
    MOVE "=HESPLANI"            TO WS-HATA-TABLE-NAME
    MOVE WS-KURULUS-KODU        TO GMU-KURULUS-KODU OF D-HESPLAN
    MOVE WS-HESAP-REF-NO        TO GMU-HESAP-REF-NO OF D-HESPLAN
    MOVE MUH-HESAP1 OF D-ISLEMTUR TO WS-DGT-KODU

   EXEC SQL
      SELECT GMU_DGT_TIPI
      INTO :GMU-DGT-TIPI OF D-HESPLAN
      FROM =HESPLANI
      WHERE   GMU_KURULUS_KODU = :GMU-KURULUS-KODU  OF D-HESPLAN AND
              GMU_HESAP_REF_NO = :GMU-HESAP-REF-NO  OF D-HESPLAN
      BROWSE ACCESS
   END-EXEC.
   EVALUATE SQLCODE OF SQLCA
     WHEN 0
       IF GMU-DGT-TIPI OF D-HESPLAN NOT EQUAL SPACE
          IF ws-dgt-kodu     EQUAL SPACE
             PERFORM Z-HESAP-NO-BUL
            display "-------------------------------------"
            display " islem-turu : " islem-turu of d-islemtur
            display "-------------------------------------"
            DISPLAY " HESAP-REF-NO : " GMU-HESAP-REF-NO OF D-HESPLAN
            display " islemtur tablosunda dagitim kodu yok"
             MOVE "5921"    TO WS-RESPONSE-CODE
             STRING WS-SHESNO-HESAP-NO  DELIMITED BY SPACE
             " HESABI ÝÇÝN DAÐITIM KODU GÝRÝLMEMÝÞ!"
           DELIMITED BY SIZE INTO WS-HATA-MESAJI
        MOVE "WARNING" TO WS-HATA-MESAJI-TIPI
        MOVE "50"      TO WS-RESPONSE-COUNTER
        PERFORM HATA-VER-WORK

             GO TO F60-DAGITIM-TIPI-KONTROL-EXIT
            ELSE
             perform f60-1-dgt-kodu-kontrol
               if ok-msg = 0 and ok-msg-ent = 0
                 PERFORM D60-1-INSERT-KONS-DAGITIM
               end-if
          END-IF
          ELSE INITIALIZE ws-dgt-kodu
       END-IF
      WHEN 100
    MOVE "5990"        TO WS-RESPONSE-CODE
       MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
       MOVE "36"          TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK
     WHEN OTHER
       MOVE "5990"        TO WS-RESPONSE-CODE
       MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
       SET WS-FATAL-ERROR TO TRUE
       MOVE "37"          TO WS-RESPONSE-COUNTER
       PERFORM HATA-VER-WORK

       GO TO F60-DAGITIM-TIPI-KONTROL-EXIT
   END-EVALUATE.

 F60-DAGITIM-TIPI-KONTROL-EXIT.
      EXIT.
******************************************************************************
  f60-1-dgt-kodu-kontrol SECTION.

    MOVE "=DAGIKODU"            TO WS-HATA-TABLE-NAME
    MOVE WS-KURULUS-KODU        TO GMU-KURULUS-KODU OF D-DAGIKODU

    EXEC SQL
    SELECT GMU_DGT_KODU INTO :GMU-DGT-KODU OF D-DAGIKODU
    FROM $DATA18.MUHTAB.DAGIKODU
    WHERE GMU_KURULUS_KODU = 1 AND
             GMU_DGT_TIPI = "YP" AND
             GMU_DGT_KODU = :MUH-HESAP1 of d-islemtur
    BROWSE ACCESS
    END-EXEC.
     EVALUATE SQLCODE OF SQLCA
     WHEN 0
     move MUH-HESAP1 of d-islemtur to ws-dgt-kodu
     WHEN 100
     display "-------------------------------------"
     display " islem-turu : " islem-turu of d-islemtur
     display "-------------------------------------"
     DISPLAY " DAGITIM KODU : " WS-DGT-KODU
     display " DAGIKODU tablosunda dagitim kodu yok"
      MOVE "5990"        TO WS-RESPONSE-CODE
      MOVE "NOT-FOUND"   TO WS-HATA-MESAJI-TIPI
      MOVE "36"          TO WS-RESPONSE-COUNTER
      PERFORM HATA-VER-WORK
     WHEN OTHER
      MOVE "5990"        TO WS-RESPONSE-CODE
      MOVE "OTHER"       TO WS-HATA-MESAJI-TIPI
      SET WS-FATAL-ERROR TO TRUE
      MOVE "37"          TO WS-RESPONSE-COUNTER
      PERFORM HATA-VER-WORK
            GO TO f60-1-dgt-kodu-kontrol-EXIT
   END-EVALUATE.
   f60-1-dgt-kodu-kontrol-EXIT.
   EXIT.

*******************************************************************************

 D60-1-INSERT-KONS-DAGITIM SECTION.

   MOVE "SDGTM"                   TO WS-HATA-SUBPROG-NAME
   MOVE WS-KURULUS-KODU           TO WS-SDGTM-KURULUS-KODU
   MOVE ENT-BOLGE-KODU OF D-ENTEG TO WS-SDGTM-BOLGE-KODU
   MOVE ENT-MERKEZ-NO  OF D-ENTEG TO WS-SDGTM-MERKEZ-NO
   MOVE ENT-SUBE-NO    OF D-ENTEG TO WS-SDGTM-SUBE-NO
   MOVE ENT-GISE-NO    OF D-ENTEG TO WS-SDGTM-GISE-NO
   MOVE WS-ISLEM-YIL              TO WS-SDGTM-ISLEM-YIL
   MOVE WS-ISLEM-AY               TO WS-SDGTM-ISLEM-AY
   MOVE WS-ISLEM-GUN              TO WS-SDGTM-ISLEM-GUN
   MOVE WS-HESAP-REF-NO           TO WS-SDGTM-HESAP-REF-NO
   MOVE WS-FIS-TURU               TO WS-SDGTM-FIS-TURU
   MOVE GMU-DGT-TIPI OF D-HESPLAN TO WS-SDGTM-DGT-TIPI
   MOVE ws-dgt-kodu               TO WS-SDGTM-DGT-KODU
   IF WS-BORC-TUTAR > WS-ALACAK-TUTAR
      MOVE WS-BORC-TUTAR   TO WS-SDGTM-TUTAR
   ELSE
      MOVE WS-ALACAK-TUTAR TO WS-SDGTM-TUTAR
   END-IF
   MOVE 999999           TO WS-SDGTM-SICIL-NO

  INITIALIZE WS-SDGTM-SYS-ERR, WS-SDGTM-SQL-ERR, WS-SDGTM-KONTROL-FLAG
  CALL "SDGTM"  USING WS-SDGTM-KURULUS-KODU, WS-SDGTM-BOLGE-KODU,
                      WS-SDGTM-MERKEZ-NO, WS-SDGTM-SUBE-NO,
                      WS-SDGTM-GISE-NO, WS-SDGTM-ISLEM-YIL,
                      WS-SDGTM-ISLEM-AY, WS-SDGTM-ISLEM-GUN,
                      WS-SDGTM-HESAP-REF-NO, WS-SDGTM-FIS-TURU,
                      WS-SDGTM-DGT-TIPI, WS-SDGTM-DGT-KODU,
                      WS-SDGTM-TUTAR, WS-SDGTM-SICIL-NO,
                      WS-SDGTM-KONTROL-FLAG, WS-SDGTM-SQL-ERR,
                      WS-SDGTM-SYS-ERR.
  IF WS-SDGTM-SQL-ERR NOT EQUAL 0
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "45"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        STRING "SDGTM SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
        DELIMITED BY SIZE  INTO WS-HATA-MESAJI
        MOVE WS-SDGTM-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SDGTM-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
  ELSE
     IF WS-SDGTM-KONTROL-FLAG = "OK"
        CONTINUE
     ELSE
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "46"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        STRING "SDGTM SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
        DELIMITED BY SIZE  INTO WS-HATA-MESAJI
        MOVE WS-SDGTM-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SDGTM-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
     END-IF
  END-IF.

 D60-1-INSERT-KONS-DAGITIM-EXIT.
                EXIT.
**************************************************************

 E50-DAGITIM-DEVIR SECTION.

   MOVE "SDGTM"                   TO WS-HATA-SUBPROG-NAME
   MOVE WS-KURULUS-KODU           TO WS-SDGTM-KURULUS-KODU
   MOVE ENT-BOLGE-KODU OF D-ENTEG TO WS-SDGTM-BOLGE-KODU
   MOVE ENT-MERKEZ-NO  OF D-ENTEG TO WS-SDGTM-MERKEZ-NO
   MOVE ENT-SUBE-NO    OF D-ENTEG TO WS-SDGTM-SUBE-NO
   MOVE ENT-GISE-NO    OF D-ENTEG TO WS-SDGTM-GISE-NO
   MOVE WS-ISLEM-YIL              TO WS-SDGTM-ISLEM-YIL
   MOVE WS-ISLEM-AY               TO WS-SDGTM-ISLEM-AY
   MOVE WS-ISLEM-GUN              TO WS-SDGTM-ISLEM-GUN
   MOVE WS-HESAP-REF-NO           TO WS-SDGTM-HESAP-REF-NO
   MOVE WS-FIS-TURU               TO WS-SDGTM-FIS-TURU
   MOVE GMU-DGT-TIPI OF D-HESPLAN TO WS-SDGTM-DGT-TIPI
   MOVE WS-DGT-KODU               TO WS-SDGTM-DGT-KODU
   IF WS-BORC-TUTAR > WS-ALACAK-TUTAR
      MOVE WS-BORC-TUTAR          TO WS-SDGTM-TUTAR
   ELSE
      MOVE WS-ALACAK-TUTAR        TO WS-SDGTM-TUTAR
   END-IF
   MOVE 999999           TO WS-SDGTM-SICIL-NO

  INITIALIZE WS-SDGTM-SYS-ERR, WS-SDGTM-SQL-ERR, WS-SDGTM-KONTROL-FLAG
  CALL "SDGTM"  USING WS-SDGTM-KURULUS-KODU, WS-SDGTM-BOLGE-KODU,
                      WS-SDGTM-MERKEZ-NO, WS-SDGTM-SUBE-NO,
                      WS-SDGTM-GISE-NO, WS-SDGTM-ISLEM-YIL,
                      WS-SDGTM-ISLEM-AY, WS-SDGTM-ISLEM-GUN,
                      WS-SDGTM-HESAP-REF-NO, WS-SDGTM-FIS-TURU,
                      WS-SDGTM-DGT-TIPI, WS-SDGTM-DGT-KODU,
                      WS-SDGTM-TUTAR, WS-SDGTM-SICIL-NO,
                      WS-SDGTM-KONTROL-FLAG, WS-SDGTM-SQL-ERR,
                      WS-SDGTM-SYS-ERR.
  IF WS-SDGTM-SQL-ERR NOT EQUAL 0
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "45"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        STRING "SDGTM SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
        DELIMITED BY SIZE  INTO WS-HATA-MESAJI
        MOVE WS-SDGTM-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SDGTM-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
  ELSE
     IF WS-SDGTM-KONTROL-FLAG = "OK"
        CONTINUE
     ELSE
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "46"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        STRING "SDGTM SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
        DELIMITED BY SIZE  INTO WS-HATA-MESAJI
        MOVE WS-SDGTM-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SDGTM-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
     END-IF
  END-IF.

 E50-DAGITIM-DEVIR-EXIT.
    EXIT.
******************************************************************************
 Z-HESAP-NO-BUL SECTION.

  MOVE "SHESNO"           TO WS-HATA-SUBPROG-NAME
  MOVE WS-KURULUS-KODU   TO WS-SHESNO-KURULUS-KODU
  MOVE WS-HESAP-REF-NO    TO WS-SHESNO-HES-REF-NO

  INITIALIZE WS-SHESNO-SYS-ERR, WS-SHESNO-SQL-ERR, WS-SHESNO-HESAP-NO
  CALL "SHESNO" USING WS-SHESNO-KURULUS-KODU, WS-SHESNO-HES-REF-NO,
                      WS-SHESNO-HESAP-NO, WS-SHESNO-SQL-ERR,
                      WS-SHESNO-SYS-ERR.

  IF WS-SHESNO-SQL-ERR NOT EQUAL 0
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "47"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        STRING "SHESNO SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
        DELIMITED BY SIZE  INTO WS-HATA-MESAJI
        MOVE WS-SHESNO-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SHESNO-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
  ELSE
     CONTINUE
  END-IF.

 Z-HESAP-NO-BUL-EXIT.
         EXIT.
******************************************************************************
 Z-1-HESAP-NO-BUL SECTION.

  MOVE "SHESNO"                      TO WS-HATA-SUBPROG-NAME
  MOVE WS-KURULUS-KODU              TO WS-SHESNO-KURULUS-KODU
  MOVE GMU-HESAP-REF-NO OF D-OZETHES TO WS-SHESNO-HES-REF-NO

  INITIALIZE WS-SHESNO-SYS-ERR, WS-SHESNO-SQL-ERR, WS-SHESNO-HESAP-NO
  CALL "SHESNO" USING WS-SHESNO-KURULUS-KODU, WS-SHESNO-HES-REF-NO,
                      WS-SHESNO-HESAP-NO, WS-SHESNO-SQL-ERR,
                      WS-SHESNO-SYS-ERR.
  IF WS-SHESNO-SQL-ERR NOT EQUAL 0
        MOVE "5921"                       TO WS-RESPONSE-CODE
        MOVE "48"                         TO WS-RESPONSE-COUNTER
        MOVE "WARNING"                    TO WS-HATA-MESAJI-TIPI
        STRING "SHESNO SUBPROGRAMI HATALI BÝTTÝ,YETKÝLÝLERE HABER VERÝNÝZ!"
        DELIMITED BY SIZE  INTO WS-HATA-MESAJI
        MOVE WS-SHESNO-SQL-ERR TO SQLCODE OF SQLCA
        MOVE WS-SHESNO-SYS-ERR TO ERRCODE OF SQL-ERROR OF SQLCA(2)
        PERFORM HATA-VER-WORK
  ELSE
     CONTINUE
  END-IF.

 Z-1-HESAP-NO-BUL-EXIT.
         EXIT.
******************************************************************************
 HATA-VER SECTION.
     MOVE 1 TO OK-MSG, OK-MSG-ENT.
     INITIALIZE WS-HATA-MESAJI
     EXEC SQL ROLLBACK WORK END-EXEC.

     IF WS-RESPONSE-CODE = "    " OR WS-RESPONSE-CODE = "0000"
        MOVE "5900" TO WS-RESPONSE-CODE
     END-IF.

     EVALUATE WS-HATA-MESAJI-TIPI
        WHEN "NOT-FOUND"
         STRING WS-HATA-TABLE-NAME " TABLOSUNDA KAYIT BULUNAMADI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "DUPLICATE"
         STRING WS-HATA-TABLE-NAME " TABLOSUNDA MUKERRER KAYIT VAR!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "NONNUMERIC"
         STRING WS-HATA-TABLE-NAME " TABLOSUNDA SAYISAL ALANA KARAKTER GELDI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "COULD-NOT-OPEN"
         STRING WS-HATA-CURSOR-NAME " CURSORU ACILAMADI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "COULD-NOT-UPDATE"
         STRING WS-HATA-TABLE-NAME " TABLOSU UPDATE EDILEMEDI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "COULD-NOT-INSERT"
         STRING WS-HATA-TABLE-NAME " TABLOSUNA KAYIT EKLENEMEDI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "OTHER"
         STRING WS-HATA-TABLE-NAME " TABLOSUNDA HATA VAR!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
     display "-------------------------------------"
     display " islem-turu : " islem-turu of d-islemtur
     display "-------------------------------------"
     DISPLAY " HESAP-REF-NO : " GMU-HESAP-REF-NO OF D-HESPLAN
     display "sqlcode :" sqlcode of sqlca
     display "merkez-no " iomerkez-no of d-ozet

        WHEN "WARNING"
         CONTINUE
        WHEN OTHER
         MOVE " " TO WS-HATA-MESAJI
     END-EVALUATE.

     DISPLAY "*************************************************************"
     DISPLAY " HATA !:" WS-HATA-MESAJI
     DISPLAY "*************************************************************"

     INITIALIZE D-ERRLOG

     MOVE WS-KURULUS-KODU TO KURULUS-KODU OF D-ERRLOG
     MOVE S-ISLEM-YY                       TO ERR-ISLEM-YIL   OF D-ERRLOG
     MOVE S-ISLEM-MM                       TO ERR-ISLEM-AY    OF D-ERRLOG
     MOVE S-ISLEM-DD                       TO ERR-ISLEM-GUN   OF D-ERRLOG
     MOVE BOLGE-KODU  OF D-PTTMRK          TO ERR-BOLGE-KODU  OF D-ERRLOG
     MOVE IOMERKEZ-NO OF D-OZET            TO ERR-MERKEZ-NO   OF D-ERRLOG
     MOVE IOSUBE-NO   OF D-OZET            TO ERR-SUBE-NO     OF D-ERRLOG
     MOVE IOGISE-NO   OF D-OZET            TO ERR-GISE-NO     OF D-ERRLOG
     MOVE "$DATA18.MUHWRK.ENT01SC"         TO ERR-SOURCE-CODE OF D-ERRLOG
     MOVE SQLCODE OF SQLCA                 TO ERR-SQL-ERR     OF D-ERRLOG
     MOVE ERRCODE OF SQL-ERROR OF SQLCA(2) TO ERR-SYS-ERR     OF D-ERRLOG
     MOVE WS-HATA-MESAJI-TIPI              TO ERR-MESAJ-TIPI  OF D-ERRLOG
     MOVE WS-RESPONSE-CODE                 TO ERR-RES-CODE    OF D-ERRLOG
     MOVE WS-RESPONSE-COUNTER              TO ERR-RES-COUNTER OF D-ERRLOG
     MOVE WS-HATA-MESAJI                   TO ERR-HATA-MESAJI OF D-ERRLOG
     MOVE FUNCTION CURRENT-DATE(1:4)       TO ERR-SISTEM-YIL  OF D-ERRLOG
     MOVE FUNCTION CURRENT-DATE(5:2)       TO ERR-SISTEM-AY   OF D-ERRLOG
     MOVE FUNCTION CURRENT-DATE(7:2)       TO ERR-SISTEM-GUN  OF D-ERRLOG
     MOVE FUNCTION CURRENT-DATE(9:8)       TO ERR-SISTEM-SAAT OF D-ERRLOG

         EXEC SQL BEGIN WORK END-EXEC.

          EXEC SQL
           INSERT INTO $DATA18.MUHTAB.ERRORLOG VALUES (
               :KURULUS-KODU    OF D-ERRLOG,
               :ERR-ISLEM-YIL   OF D-ERRLOG,
               :ERR-ISLEM-AY    OF D-ERRLOG,
               :ERR-ISLEM-GUN   OF D-ERRLOG,
               :ERR-BOLGE-KODU  OF D-ERRLOG,
               :ERR-MERKEZ-NO   OF D-ERRLOG,
               :ERR-SUBE-NO     OF D-ERRLOG,
               :ERR-GISE-NO     OF D-ERRLOG,
               :ERR-SOURCE-CODE OF D-ERRLOG,
               :ERR-SQL-ERR     OF D-ERRLOG,
               :ERR-SYS-ERR     OF D-ERRLOG,
               :ERR-MESAJ-TIPI  OF D-ERRLOG,
               :ERR-RES-CODE    OF D-ERRLOG,
               :ERR-RES-COUNTER OF D-ERRLOG,
               :ERR-HATA-MESAJI OF D-ERRLOG,
               :ERR-SISTEM-YIL  OF D-ERRLOG,
               :ERR-SISTEM-AY   OF D-ERRLOG,
               :ERR-SISTEM-GUN  OF D-ERRLOG,
               :ERR-SISTEM-SAAT OF D-ERRLOG)
      END-EXEC.

      EXEC SQL COMMIT WORK END-EXEC.

     DISPLAY "*************************************************************"
     DISPLAY " PROGRAM HATA ALDI, SONLANDIRILIYOR! "
     DISPLAY "*************************************************************"

     ENTER TAL "ABORTTRANSACTION".
     STOP RUN.

  HATA-VER-EXIT.
     EXIT.
*******************************************************************************
 HATA-VER-WORK SECTION.

  MOVE 1 TO OK-MSG-ENT, OK-MSG
  IF WS-KAYITVAR-FLAG = 1
  SET WS-BASARISIZ-FLAG         TO TRUE
  END-IF
  SET WS-TRANSACTION-BITIR-FLAG TO TRUE
  IF WS-CURSOR-ACIK-FLAG
     EXEC SQL CLOSE SELECT_MFYS END-EXEC
  END-IF.
  INITIALIZE WS-HATA-MESAJI

*-----------------------------------------*
     EXEC SQL ROLLBACK WORK END-EXEC.
*-----------------------------------------*

     EVALUATE WS-HATA-MESAJI-TIPI
        WHEN "NOT-FOUND"
         STRING WS-HATA-TABLE-NAME " TABLOSUNDA KAYIT BULUNAMADI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "DUPLICATE"
         STRING WS-HATA-TABLE-NAME " TABLOSUNDA MUKERRER KAYIT VAR!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "NONNUMERIC"
         STRING WS-HATA-TABLE-NAME " TABLOSUNDA SAYISAL ALANA KARAKTER GELDI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "COULD-NOT-OPEN"
         STRING WS-HATA-CURSOR-NAME " CURSORU ACILAMADI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "COULD-NOT-UPDATE"
         STRING WS-HATA-TABLE-NAME " TABLOSU UPDATE EDILEMEDI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "COULD-NOT-INSERT"
         STRING WS-HATA-TABLE-NAME " TABLOSUNA KAYIT EKLENEMEDI!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        WHEN "OTHER"
     display "-------------------------------------"
     display " islem-turu : " islem-turu of d-islemtur
     display "-------------------------------------"
     DISPLAY " HESAP-REF-NO : " GMU-HESAP-REF-NO OF D-HESPLAN
         STRING WS-HATA-TABLE-NAME " TABLOSUNDA HATA VAR!"
         DELIMITED BY SIZE INTO WS-HATA-MESAJI
        display "sqlcode :" sqlcode of sqlca
        display "merkez-no " iomerkez-no of d-ozet
        WHEN "WARNING"
         CONTINUE
        WHEN OTHER
         MOVE " " TO WS-HATA-MESAJI
     END-EVALUATE.

     DISPLAY "*************************************************************"
     DISPLAY " HATA !:" WS-HATA-MESAJI
     DISPLAY "*************************************************************"

     INITIALIZE D-ERRLOG

     MOVE WS-KURULUS-KODU TO KURULUS-KODU OF D-ERRLOG
     MOVE S-ISLEM-YY                       TO ERR-ISLEM-YIL   OF D-ERRLOG
     MOVE S-ISLEM-MM                       TO ERR-ISLEM-AY    OF D-ERRLOG
     MOVE S-ISLEM-DD                       TO ERR-ISLEM-GUN   OF D-ERRLOG
     MOVE BOLGE-KODU  OF D-PTTMRK          TO ERR-BOLGE-KODU  OF D-ERRLOG
     MOVE IOMERKEZ-NO OF D-OZET            TO ERR-MERKEZ-NO   OF D-ERRLOG
     MOVE IOSUBE-NO   OF D-OZET            TO ERR-SUBE-NO     OF D-ERRLOG
     MOVE IOGISE-NO   OF D-OZET            TO ERR-GISE-NO     OF D-ERRLOG
     MOVE "$DATA18.MUHWRK.ENT01SC"         TO ERR-SOURCE-CODE OF D-ERRLOG
     MOVE SQLCODE OF SQLCA                 TO ERR-SQL-ERR     OF D-ERRLOG
     MOVE ERRCODE OF SQL-ERROR OF SQLCA(2) TO ERR-SYS-ERR     OF D-ERRLOG
     MOVE WS-HATA-MESAJI-TIPI              TO ERR-MESAJ-TIPI  OF D-ERRLOG
     MOVE WS-RESPONSE-CODE                 TO ERR-RES-CODE    OF D-ERRLOG
     MOVE WS-RESPONSE-COUNTER              TO ERR-RES-COUNTER OF D-ERRLOG
     MOVE WS-HATA-MESAJI                   TO ERR-HATA-MESAJI OF D-ERRLOG
     MOVE FUNCTION CURRENT-DATE(1:4)       TO ERR-SISTEM-YIL  OF D-ERRLOG
     MOVE FUNCTION CURRENT-DATE(5:2)       TO ERR-SISTEM-AY   OF D-ERRLOG
     MOVE FUNCTION CURRENT-DATE(7:2)       TO ERR-SISTEM-GUN  OF D-ERRLOG
     MOVE FUNCTION CURRENT-DATE(9:8)       TO ERR-SISTEM-SAAT OF D-ERRLOG

         EXEC SQL BEGIN WORK END-EXEC.

          EXEC SQL
           INSERT INTO $DATA18.MUHTAB.ERRORLOG VALUES (
               :KURULUS-KODU    OF D-ERRLOG,
               :ERR-ISLEM-YIL   OF D-ERRLOG,
               :ERR-ISLEM-AY    OF D-ERRLOG,
               :ERR-ISLEM-GUN   OF D-ERRLOG,
               :ERR-BOLGE-KODU  OF D-ERRLOG,
               :ERR-MERKEZ-NO   OF D-ERRLOG,
               :ERR-SUBE-NO     OF D-ERRLOG,
               :ERR-GISE-NO     OF D-ERRLOG,
               :ERR-SOURCE-CODE OF D-ERRLOG,
               :ERR-SQL-ERR     OF D-ERRLOG,
               :ERR-SYS-ERR     OF D-ERRLOG,
               :ERR-MESAJ-TIPI  OF D-ERRLOG,
               :ERR-RES-CODE    OF D-ERRLOG,
               :ERR-RES-COUNTER OF D-ERRLOG,
               :ERR-HATA-MESAJI OF D-ERRLOG,
               :ERR-SISTEM-YIL  OF D-ERRLOG,
               :ERR-SISTEM-AY   OF D-ERRLOG,
               :ERR-SISTEM-GUN  OF D-ERRLOG,
               :ERR-SISTEM-SAAT OF D-ERRLOG)
      END-EXEC.

      EXEC SQL COMMIT WORK END-EXEC.

*  IF WS-CURSOR-ACIK-FLAG
*     GO TO MARK-MERKEZ-ENT-BITIR
*     EXIT PERFORM
*  END-IF.
  HATA-VER-WORK-EXIT.
     EXIT.
*******************************************************************************
 INSERT-SONUC-RAPOR SECTION.

   MOVE WS-KURULUS-KODU TO KURULUS-KODU OF D-ERRLOG
   MOVE S-ISLEM-YY                       TO ISLEM-YIL   OF D-ENTSONUC
   MOVE S-ISLEM-MM                       TO ISLEM-AY    OF D-ENTSONUC
   MOVE S-ISLEM-DD                       TO ISLEM-GUN   OF D-ENTSONUC
   MOVE S-BOLGE-KODU                     TO BOLGE-KODU  OF D-ENTSONUC
   MOVE S-MERKEZ-NO                      TO MERKEZ-NO   OF D-ENTSONUC
   MOVE 0                                TO SUBE-NO     OF D-ENTSONUC
   MOVE FUNCTION CURRENT-DATE(1:4)       TO SISTEM-YIL  OF D-ENTSONUC
   MOVE FUNCTION CURRENT-DATE(5:2)       TO SISTEM-AY   OF D-ENTSONUC
   MOVE FUNCTION CURRENT-DATE(7:2)       TO SISTEM-GUN  OF D-ENTSONUC
   MOVE FUNCTION CURRENT-DATE(9:8)       TO SISTEM-SAAT OF D-ENTSONUC

   IF WS-BASARISIZ-FLAG
      MOVE "NOTOK" TO SONUC OF D-ENTSONUC
   ELSE
      IF WS-KAYITVAR-FLAG = 1
      MOVE "OK"    TO SONUC OF D-ENTSONUC
      ELSE
      MOVE "NOTR"  TO SONUC OF D-ENTSONUC
   END-IF
   END-IF
    MOVE 0 TO WS-KAYITVAR-FLAG
   EXEC SQL BEGIN WORK END-EXEC.

        EXEC SQL
          INSERT INTO $DATA18.MUHTAB.ENTSONUC VALUES (
               :KURULUS-KODU    OF D-ENTSONUC,
               :ISLEM-YIL       OF D-ENTSONUC,
               :ISLEM-AY        OF D-ENTSONUC,
               :ISLEM-GUN       OF D-ENTSONUC,
               :BOLGE-KODU      OF D-ENTSONUC,
               :MERKEZ-NO       OF D-ENTSONUC,
               :SUBE-NO         OF D-ENTSONUC,
               :SONUC           OF D-ENTSONUC,
               :SISTEM-YIL      OF D-ENTSONUC,
               :SISTEM-AY       OF D-ENTSONUC,
               :SISTEM-GUN      OF D-ENTSONUC,
               :SISTEM-SAAT     OF D-ENTSONUC)
       END-EXEC.

      EXEC SQL COMMIT WORK END-EXEC.

 INSERT-SONUC-RAPOR-EXIT.
        EXIT.
******************************************************************************
